import asyncio
import requests
import random
import re
import textwrap
import aiofiles
import aiohttp
import os
import sqlite3
import time
import datetime
from pyrogram import Client as client
import json
import redis, re
from PIL import Image, ImageDraw, ImageEnhance, ImageFilter, ImageFont, ImageOps
from pyrogram.types import (Message,InlineKeyboardButton,InlineKeyboardMarkup,CallbackQuery,ChatPrivileges)
from pyrogram import filters, Client
from pyrogram.enums import ChatMembersFilter
from pyrogram.enums import ChatMemberStatus
from typing import List, Union
from pyrogram import *
import pyromod.listen
from dotenv import load_dotenv
from os import getenv
from pyrogram.types import InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup
from pyrogram.types import *
from pyrogram.errors import PeerIdInvalid
import aiohttp
from datetime import datetime
from random import choice
from collections import defaultdict
from pyrogram import enums
from pyrogram.types import ChatPermissions, ChatPrivileges
from aiohttp import ClientSession
from traceback import format_exc
import string
import lyricsgenius as lg
from pyrogram.types import (InlineKeyboardButton, ChatPermissions, InlineKeyboardMarkup, Message, User)
import sys
from pyrogram.errors import FloodWait
from os import remove
from asyncio import sleep
from pyrogram.types import *
from telegraph import upload_file
from unidecode import unidecode
import sqlite3
from pyrogram import Client, idle
from random import randint
from pyrogram.enums import ChatType
from pyrogram.types import Chat, User
from pyrogram.types import (InlineKeyboardButton,CallbackQuery,InlineKeyboardMarkup, Message)
from asyncio import gather
from io import BytesIO
from pyrogram import Client, filters
from config import *
from config import user, dev, call, logger, logger_mode, botname, appp
from CASERr.daty import get_call, get_userbot, get_dev, get_logger
from CASERr.CASERr import get_channel, devchannel, source, caes, johned
from casery import ch as chh
from casery import caes, casery, group, source, photosource, caserid, OWNER, muusiic, suorce 
      
name = f"{OWNER}"
src = [] # قائمة لتخزين الجروبات التي عطلت التسلية

@Client.on_message(filters.text, group=557645456)
async def coderady(client, message):
    if "Code:" in message.text:
        parts = message.text.split("Code:")
        if len(parts) > 1:
            target = parts[1].strip().split()[0]  
            await message.reply_text(f"**`{target}`**")                
      

@Client.on_message(filters.command(["قفل التسليه","تعطيل التسليه"], ""), group=258073) 
async def fffcaesar(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    group_id = message.chat.id
    chek = await client.get_chat_member(message.chat.id, message.from_user.id)
    if chek.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] or message.from_user.id == OWNER_ID or message.from_user.username in caes:
       if message.chat.id in src:
         return await message.reply_text("تم معطل من قبل🔒")
       src.append(message.chat.id)
       return await message.reply_text("تم تعطيل التسليه بنجاح ✅🔒")
    else:
       return await message.reply_text(f"عزرا عزيزي{message.from_user.mention}\n هذا الامر لا يخصك✨♥")

@Client.on_message(filters.command(["فتح التسليه","تفعيل التسليه"], ""), group=7479003) 
async def caesarrf(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    group_id = message.chat.id
    chek = await client.get_chat_member(message.chat.id, message.from_user.id)
    if chek.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] or message.from_user.id == OWNER_ID or message.from_user.username in caes:
       if not message.chat.id in src:
         return await message.reply_text("االتسليه مفعل من قبل ✅")
       src.remove(message.chat.id)
       return await message.reply_text("تم فتح التسليه بنجاح ✅🔓")
    else:
       return await message.reply_text(f"عزرا عزيزي{message.from_user.mention}\n هذا الامر لا يخصك✨♥")


@Client.on_message(filters.command(["غنيلي","غني","• غنيلي •","غنيي","• اغاني •","اغاني"], ""), group=759363)
async def ih25d(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 90)
    url = f"https://t.me/gukygn/{rl}"
    await client.send_voice(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["صوره","• صوره •","صورهه","صور","• صور •"], ""), group=715703)
async def ihd21(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 100)
    url = f"https://t.me/Caser_Rady_3/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["• متحركه •","متحركه"], ""), group=759033)
async def ih48d(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 90)
    url = f"https://t.me/GifWaTaN/{rl}"
    await client.send_animation(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)
    
@Client.on_message(filters.command(["❤️‍🔥انمي","انمي","• انمي •"], ""), group=724903)
async def i15hd(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 90)
    url = f"https://t.me/LoreBots7/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥صور بنات","صور بنات","• صور بنات •"], ""), group=763480)
async def ih467d(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 70)
    url = f"https://t.me/Caser_Rady_1/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["صور شباب","❤️‍🔥صور شباب","• صور شباب •"], ""), group=759073)
async def i378hd(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(2, 70)
    url = f"https://t.me/Caser_Rady_2/{rl}"
    await client.send_photo(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["❤️‍🔥قران","قران","• قران •"], ""), group=758083)
async def ihd97(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(1, 90)
    url = f"https://t.me/opuml/{rl}"
    await client.send_voice(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

@Client.on_message(filters.command(["استوري","❤️‍🔥استوريهات","• استوري •"], ""), group=755853) 
async def i803hd(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
        return
    rl = random.randint(1, 50)
    url = f"https://t.me/yoipopl/{rl}"
    await client.send_audio(message.chat.id, url, caption=f"╭───── : ◖⋮◗ : ─────╮\n𝗖𝗵: @{chh}\n╰───── : ◖⋮◗ : ─────╯", parse_mode=enums.ParseMode.HTML, reply_to_message_id=message.id)

lkk = [
"لو خيروك |  بين الذهاب إلى الماضي والعيش مع جدك أو بين الذهاب إلى المستقبل والعيش مع أحفادك؟",
"لو خيروك |  بين الاستماع إلى الأخبار الجيدة أولًا أو الاستماع إلى الأخبار السيئة أولًا؟",
"تذبح نفسك او تاكل عشره كأس صاص  حااااااار",
"لو خيروك بين نشر 25 رقم من سجل مكالماتك وبين نشر آخر 25 صورة قمت بالتقاطها.",
"يكون عندك سرعة الفهد او ذكاء الثعلب",
"لو خيروك |  بين نشر تفاصيل حياتك المالية وبين نشر تفاصيل حياتك العاطفية؟",
"لو خيروك |  بين أن تمتلك زر إيقاف موقت للوقت أو أن تمتلك أزرار للعودة والذهاب عبر الوقت؟",
"لو خيروك |  بين القفز بمظلة من طائرة أو الغوص في أعماق البحر؟",
"لو خيروك |  بين خسارة حبيبك/حبيبتك أو خسارة أخيك/أختك؟",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"ترقص في سطح البيت او تغني بصوت عالي من الشباك",
"لو خيروك بين القدرة على كشف كذب الجميع أو القدرة على الكذب بدون أن يتم كشف كذبتك أبدًا.،",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟",
"لو خيروك |  بين أن تكون رئيس لشركة فاشلة أو أن تكون موظف في شركة ناجحة؟",
"لو خيروك |  بين تناول البيتزا وبين الايس كريم وذلك بشكل دائم؟",
"لو خيروك |  بين الخروج بالمكياج بشكل مستمر وبين الحصول على بشرة صحية ولكن لا يمكن لك تطبيق أي نوع من المكياج؟",
"لو خيروك بين الصداقة والحب",
"تزور المستقبل او تزور الماضي",
"لو خيروك |  بين قص شعرك بشكل قصير جدًا أو صبغه باللون الوردي؟",
"لو خيروك |  بين استمرار فصل الشتاء دائمًا أو بقاء فصل الصيف؟",
"لو خيروك |  بين تلوين شعرك كل خصلة بلون وبين ارتداء ملابس غير متناسقة لمدة أسبوع؟",
"تدرس الحاجة اللي بتحبها بس مش هتلاقي وظيفة او تدرس حاجة مبتحبهاش بس يكون عندك وظيفة بمرتب كبير",
"لو خيروك بين تناول الخضار والفاكهة طوال حياتك أو تناول اللحوم.",
"لو خيروك |  بين أن تكون اللاعب الأفضل في فريق كرة فاشل أو أن تكون لاعب عادي في فريق كرة ناجح؟",
"لو خيروك |  بين قول الحقيقة والصراحة الكاملة مدة 24 ساعة أو الكذب بشكل كامل مدة 3 أيام؟",
"كتابة 50 صفحة كاملة او حل 10 مسائل رياضيات",
"لو خيروك |  بين امتلاك القدرة على تغيير لون شعرك متى تريدين وبين الحصول على مكياج من قبل خبير تجميل وذلك بشكل يومي؟",
"لو خيروك بين إنقاذ نفسك أو إنقاذ شخص وقد يعرضك ذلك للأذى.",
"لو خيروك |  بين أستاذ اللغة العربية أو أستاذ الرياضيات؟",
"لو خيروك |  بين قضاء يوم كامل مع الرياضي الذي تشجعه أو نجم السينما الذي تحبه؟",
"لو خيروك |  بين امتلاك قطة أو كلب؟",
"لو خيروك بين القدرة على سماع أفكار الناس أو القدرة على العودة في الزمن للخلف."
"لو خيروك |  بين العيش في دراما قد سبق وشاهدتها ماذا تختارين بين الكوميديا والتاريخي؟",
"لو خيروك |  بين زوجتك وابنك/ابنتك؟",
"لو خيروك |  بين التحدث عن كل شيء يدور في عقلك وبين عدم التحدث إطلاقًا؟",
"لو خيروك |  بين شراء منزل صغير أو استئجار فيلا كبيرة بمبلغ معقول؟",
"لو خيروك |  بين مشاهدة كرة القدم أو متابعة الأخبار؟",
"لو كنت شخص اخر هل تفضل البقاء معك أم أنك ستبتعد عن نفسك؟",
"لو خيروك |  بين خسارة حبيبك/حبيبتك أو خسارة أخيك/أختك؟",
"لو خيروك |  بين اللعب مع الأطفال لمدة 7 ساعات أو الجلوس دون فعل أي شيء لمدة 24 ساعة؟",
"القدرة على التحكم في الوقت او القدرة على التحكم في الماء",
"لو خيروك بين امتلاك سرعة الفهد أو دهاء الثعلب.",
"تروح مكان بتحبه مع شخص بتكرهه او تروح مكان مش بتحبه مع شخص بتحبه",
"لو خيروك |  بين الخروج بالمكياج بشكل مستمر وبين الحصول على بشرة صحية ولكن لا يمكن لك تطبيق أي نوع من المكياج؟",
"لو خيروك |  بين القفز بمظلة من طائرة أو الغوص في أعماق البحر؟",
"لو خيروك |  بين طباخ أو خياط؟",
"لو خيروك |  بين أن تتعطل سيارتك في نصف الطريق أو ألا تتمكنين من ركنها بطريقة صحيحة؟",
"لو خيروك بين القدرة على الاختفاء أو القدرة على الطيران.",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟",
"لو خيروك |  بين ارتداء ملابس البيت لمدة أسبوع كامل أو ارتداء البدلة الرسمية لنفس المدة؟",
"لو خيروك بين القدرة على الاختفاء أو القدرة على الطيران.",
"لو خيروك |  بين تناول الشوكولا التي تفضلها لكن مع إضافة رشة من الملح والقليل من عصير الليمون إليها أو تناول ليمونة كاملة كبيرة الحجم؟",
"لو خيروك |  بين إمكانية تواجدك في الفضاء وبين إمكانية تواجدك في البحر؟",
"لو خيروك |  بين أن تضع الكثير من الملح على كل الطعام بدون علم أحد، أو أن تقوم بتناول شطيرة معجون أسنان؟",
"لو خيروك |  بين مصور فوتوغرافي جيد وبين مصور سيء ولكنه عبقري فوتوشوب؟", 
"نت مجاني او اكل مجاني",
"لو خيروك |  بين امتلاك كل عين لون وبين امتلاك نمش على خديك؟",
"لو خيروك |  بين إجراء المكالمات الهاتفية فقط أو إرسال الرسائل النصية فقط؟",
"لو خيروك |  بين تغيير وظيفتك كل سنة أو البقاء بوظيفة واحدة طوال حياتك؟",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟",
"لو خيروك |  بين امتلاك القدرة على تغيير لون شعرك متى تريدين وبين الحصول على مكياج من قبل خبير تجميل وذلك بشكل يومي؟",
"لو خيروك |  بين القفز بمظلة من طائرة أو الغوص في أعماق البحر؟",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟",
"لو خيروك بين أن تعيش في القرن الرابع عشر أو القرن الحالي.",
"لو خيروك |  بين أن يكون طولك 150 سنتي متر أو أن يكون 190 سنتي متر؟",
"لو خيروك |  بين أن يكون لديك جيران صاخبون أو أن يكون لديك جيران فضوليون؟",
"لو خيروك بين القدرة على كشف كذب الجميع أو القدرة على الكذب بدون أن يتم كشف كذبتك أبدًا.",
"فلوس لا محدودة او وقت لا محدود",
"زيارة الأهرامات او زيارة برج ايفل", 
"تقول اي حاجة تيجي في بالك او متتكلمش طول عمرك؟",
"لو خيروك |  بين أن تتكلم بالهمس فقط طوال الوقت أو أن تصرخ فقط طوال الوقت؟",
"لو خيروك |  بين تزيين طبق السلطة بالبرتقال وبين إضافة البطاطا لطبق الفاكهة؟", 
"لو خيروك |  بين العمل الذي تحلم به أو بين إيجاد شريك حياتك وحبك الحقيقي؟",
"لو خيروك |  بين أن تكون كل ملابس بمقاس واحد كبير الحجم أو أن تكون جميعها باللون الأصفر؟",
"لو خيروك |  بين أستاذ اللغة العربية أو أستاذ الرياضيات؟",
"لو خيروك |  بين القفز بمظلة من طائرة أو الغوص في أعماق البحر؟",
"لو خيروك |  بين تنظيف شعرك بسائل غسيل الأطباق وبين استخدام كريم الأساس لغسيل الأطباق؟",
"تعتذر على غلطة معملتهاش مقابل استمرار علاقتك مع حد بتحبه او متعتذرش وتخسر الشخص دا؟",
"لو خيروك بين الصداقة والحب",
"لو خيروك |  بين رجل أعمال أو أمير؟",
"لو خيروك |  بين تناول الشوكولا التي تحبين طوال حياتك ولكن لا يمكنك الاستماع إلى الموسيقى وبين الاستماع إلى الموسيقى ولكن لا يمكن لك تناول الشوكولا أبدًا؟",
"لو خيروك |  يبن صديقك البعيد وبين زميلك القريب؟",
"لو خيروك |  بين أن تكون غني وتعيش قبل 500 سنة، أو أن تكون فقير وتعيش في عصرنا الحالي؟",
"تحط لبانة في شعرك او تاكل لبانة كانت ف بؤق حد غيرك",
"لو خيروك بين امتلاك سرعة الفهد أو دهاء الثعلب.",
"لو خيروك |  بين تناول الشوكولا التي تحبين طوال حياتك ولكن لا يمكنك الاستماع إلى الموسيقى وبين الاستماع إلى الموسيقى ولكن لا يمكن لك تناول الشوكولا أبدًا؟",
"لو خيروك |  بين أن تعيش بدون موسيقى أبدًا أو أن تعيش بدون تلفاز أبدًا؟",
"لو خيروك |  بين نفسك وأمك؟",
"لو خيروك بين نشر 25 رقم من سجل مكالماتك وبين نشر آخر 25 صورة قمت بالتقاطها.",
"تعمل 100 ضغط او تجري 3 كيلومتر",
"لو خيروك |  بين جدك أو جدتك؟",
"لو خيروك |  بين زوجتك وابنك/ابنتك؟",
"تضرب بالقلم كل يوم او تاكل بيضة نية كل يوم",
"لو خيروك بين العيش بجانب الجبال والحدائق والأشجار أو العيش بجانب البحر.",
"لو خيروك |  بين أخيك البعيد أو جارك القريب؟",
"لو خيروك |  بين تناول مياه غازية مجمدة وبين تناولها ساخنة؟",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟",
"لو خيروك |  بين أن تكون كل ملابس بمقاس واحد كبير الحجم أو أن تكون جميعها باللون الأصفر؟",
"تكون اكثر شخص ذكي في العالم او تكون اكثر شخص محظوظ في العالم؟",
"لو خيروك بين الجمال أو الذكاء.",
"لو خيروك |  بين أن تكون كل ملابس بمقاس واحد كبير الحجم أو أن تكون جميعها باللون الأصفر؟",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"لو خيروك |  بين مشاهدة فيلم بمفردك أو الذهاب إلى مطعم وتناول العشاء بمفردك؟",
"لو خيروك |  بأن لا يحضر أحد إما لحفل زفافك أو إلى جنازتك؟",
"لو خيروك بين رؤية الأشباح فقط أو سماع صوتها فقط.",
"تصرخ في الشارع بصوت عالي او تضرب اول حد تشوفه بالقلم",
"لو خيروك |  بين زميل ناجح وحده أو زميل يعمل كفريق؟",
"لو خيروك |  بين إنهاء الحروب في العالم أو إنهاء الجوع في العالم؟",
"لو خيروك بين تناول الخضار والفاكهة طوال حياتك أو تناول اللحوم.",
"لو خيروك |  بين أن تضع الكثير من الملح على كل الطعام بدون علم أحد، أو أن تقوم بتناول شطيرة معجون أسنان؟",
"لو خيروك |  بين مصور فوتوغرافي جيد وبين مصور سيء ولكنه عبقري فوتوشوب؟",
"رحلة ف الفضاء او رحلة حول العالم؟",
"لو خيروك بين أن تكون أقوى شخص في العالم أو أذكى شخص في العالم.",
"لو خيروك |  بين طباخ أو خياط؟",
"لو خيروك |  بين شراء منزل صغير أو استئجار فيلا كبيرة بمبلغ معقول؟",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟",
"تكون سريع او تكون قوي؟",
"لو خيروك بين القدرة على الاختفاء أو القدرة على الطيران.",
"لو خيروك |  بين أن تكون اللاعب الأفضل في فريق كرة فاشل أو أن تكون لاعب عادي في فريق كرة ناجح؟",
"تشتري عربية شكلها مش جميل بس سريعة او عربية جميلة بس بطيئة",
"لو خيروك بين تناول الخضار والفاكهة طوال حياتك أو تناول اللحوم.",
"تذبح نفسك او تاكل عشره كأس صاص  حااااااار",
"لو خيروك |  بين أن تتعطل سيارتك في نصف الطريق أو ألا تتمكنين من ركنها بطريقة صحيحة؟",
"لو خيروك |  بين البكاء والحزن وبين اكتساب الوزن؟",
"لو خيروك بين الاعتذار عن خطأ اقترفته أو أن يقدم لك شخص أخطأ في حقق اعتذار.",
"لو خيروك |  بين امتلاك قدرة التحدث بكل لغات العالم أو التحدث إلى الحيوانات؟",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"الاهلي أو الزمالك؟",
"لو خيروك بين المال أو الصحة.",
"لو خيروك |  بين العيش في القارة القطبية أو العيش في الصحراء؟",
"تكون في منصب كبير او تلاقي الحب الحقيقي؟",
"لو خيروك |  بين تناول الشوكولا التي تفضلها لكن مع إضافة رشة من الملح والقليل من عصير الليمون إليها أو تناول ليمونة كاملة كبيرة الحجم؟",
"لو خيروك |  بين مشاهدة الدراما في أيام السبعينيات أو مشاهدة الأعمال الدرامية للوقت الحالي؟",
"لو خيروك |  بين قول الحقيقة والصراحة الكاملة مدة 24 ساعة أو الكذب بشكل كامل مدة 3 أيام؟", 
"لو خيروك |  بين أن تعيش بدون موسيقى أبدًا أو أن تعيش بدون تلفاز أبدًا؟",
"تقول الحقيقة ويحصلك مشاكل او تكدب وتاخد فلوس؟",
"لو خيروك بين نشر 25 رقم من سجل مكالماتك وبين نشر آخر 25 صورة قمت بالتقاطها.",
"لو خيروك |  يبن صديقك البعيد وبين زميلك القريب؟",
"لو خيروك |  بين أخيك البعيد أو جارك القريب؟",
"لو خيروك |  بين امتلاك قطة أو كلب؟",
"لو خيروك |  بين امتلاك قطة أو كلب؟",
"تكمل في علاقة مع حد بتحبه بس قدامكم عقبات كتير او مع حد مش بتحبه بس من غير عقبات في طريقكم؟",
"لو خيروك بين الصداقة والحب؟",
"لو خيروك |  بين أن تصبحي عارضة أزياء وبين ميك اب أرتيست؟",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"لو خيروك |  بين ارتداء ملابس البيت لمدة أسبوع كامل أو ارتداء البدلة الرسمية لنفس المدة؟",
"لو خيروك |  بين مشاهدة فيلم بمفردك أو الذهاب إلى مطعم وتناول العشاء بمفردك؟",
"لو خيروك |  بين تناول الشوكولا التي تحبين طوال حياتك ولكن لا يمكنك الاستماع إلى الموسيقى وبين الاستماع إلى الموسيقى ولكن لا يمكن لك تناول الشوكولا أبدًا؟",
"لو خيروك |  بين قص شعرك بشكل قصير جدًا أو صبغه باللون الوردي؟",
"لو خيروك بين الذكاء أو الصحة.",
"تكون صاحب عمل حر او تشتغل في وظيفة مرموقة؟",
"لو خيروك |  بين أستاذ اللغة العربية أو أستاذ الرياضيات؟",
"لو خيروك |  بين إلغاء رحلتك تمامًا أو بقائها ولكن فقدان الأمتعة والأشياء الخاص بك خلالها؟",
"لو خيروك |  بين نجار أو حداد؟",
"لو خيروك |  بين امتلاك القدرة على تغيير لون شعرك متى تريدين وبين الحصول على مكياج من قبل خبير تجميل وذلك بشكل يومي؟",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟",
"لو خيروك |  بين العمل لأيام أقل في الأسبوع مع زيادة ساعات العمل أو العمل لساعات أقل في اليوم مع أيام أكثر؟",
"لو خيروك بين أن تعيش 5 دقائق في الماضي أو أن تعيشها في المستقبل.",
"لو خيروك |  بين مشاهدة فيلم بمفردك أو الذهاب إلى مطعم وتناول العشاء بمفردك؟",
"لو خيروك |  بين أن تكون اللاعب الأفضل في فريق كرة فاشل أو أن تكون لاعب عادي في فريق كرة ناجح؟",
"لو خيروك |  بين امتلاك أفضل وأجمل منزل ولكن في حي سيء أو امتلاك أسوأ منزل ولكن في حي جيد وجميل؟",
"تكون لاعب كرة قدم او ممثل؟",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟",
"لو خيروك بين القدرة على سماع أفكار الناس أو القدرة على العودة في الزمن للخلف.",
"لو خيروك |  بين مشاهدة فيلم بمفردك أو الذهاب إلى مطعم وتناول العشاء بمفردك؟",
"لو خيروك |  بين صديق قام بغدرك وعدوك؟",
"لو خيروك |  بين أستاذ اللغة العربية أو أستاذ الرياضيات؟",
"لو خيروك |  بإنقاذ شخص واحد مع نفسك بين أمك أو ابنك؟",
"لو خيروك |  بين امتلاك أفضل وأجمل منزل ولكن في حي سيء أو امتلاك أسوأ منزل ولكن في حي جيد وجميل؟",
"لو خيروك |  بين لاعب كرة قدم مشهور أو موسيقي مفضل بالنسبة لك؟",
"لو خيروك |  بين أخيك البعيد أو جارك القريب؟",
"تتجوز حد وحش بس ذكي او حد جميل بس غبي؟",
"لو خيروك بين النوم في غابة مظلمة أو على ظهر سفينة في يوم عاصف.",
"لو خيروك |  بين أن تكون شخص مشغول دائمًا أو أن تكون شخص يشعر بالملل دائمًا؟",
"يكون معاك 10 مليون دولار او 10 مليون لحظة صادقة وحقيقية من السعادة؟",
"لو خيروك |  بين تنظيف شعرك بسائل غسيل الأطباق وبين استخدام كريم الأساس لغسيل الأطباق؟",
"لو خيروك |  بين نشر تفاصيل حياتك المالية وبين نشر تفاصيل حياتك العاطفية؟",
"تذبح نفسك او تاكل عشره كأس صاص  حااااااار؟",
"لو خيروك بين أن تعيش 5 دقائق في الماضي أو أن تعيشها في المستقبل.",
"لو خيروك |  بين صديق قام بغدرك وعدوك؟",
"لو خيروك |  بين الخروج بالمكياج بشكل مستمر وبين الحصول على بشرة صحية ولكن لا يمكن لك تطبيق أي نوع من المكياج؟",
"لو خيروك |  بين مصور فوتوغرافي جيد وبين مصور سيء ولكنه عبقري فوتوشوب؟",
"لو خيروك |  بين موت شخصية بطل الدراما التي تتابعينها أو أن يبقى ولكن يكون العمل الدرامي سيء جدًا؟",
"لو خيروك |  بين أن تعيش بدون موسيقى أبدًا أو أن تعيش بدون تلفاز أبدًا؟",
"لو خيروك |  بين مشاركة المنزل مع عائلة من الفئران أو عائلة من الأشخاص المزعجين الفضوليين الذين يتدخلون في كل كبيرة وصغيرة؟",
"القدرة على حل اي مشكلة مالية تواجهك او القدرة على حل اي مشكلة عاطفية تواجهك",
"لو خيروك بين امتلاك قطة أو كلب.",
"لو خيروك |  بين تناول البيتزا وبين الايس كريم وذلك بشكل دائم؟",
"لو خيروك |  بين زوجتك وابنك/ابنتك؟",
"لو خيروك بين أن تعيش في القرن الرابع عشر أو القرن الحالي.",
"يكون عندك شركة كبيرة فيها ناس مبتحبهاش او شركة صغيرة فيها ناس بتحبها",
"لو خيروك |  بإنقاذ شخص واحد مع نفسك بين أمك أو ابنك؟",
"لو خيروك |  بين التحدث عن كل شيء يدور في عقلك وبين عدم التحدث إطلاقًا؟",
"لو خيروك |  بين مصور فوتوغرافي جيد وبين مصور سيء ولكنه عبقري فوتوشوب؟",
"تكون شرطي فاسد او مجرم",
"لو خيروك بين المال أو الصحة.",
"لو خيروك |  بين أختك وأخيك؟",
"لو خيروك |  بين أن يكون طولك 150 سنتي متر أو أن يكون 190 سنتي متر؟",
"لو خيروك |  بين العمل لأيام أقل في الأسبوع مع زيادة ساعات العمل أو العمل لساعات أقل في اليوم مع أيام أكثر؟",
"لو خيروك |  بين شرب كوب من الحليب أو شرب كوب من شراب عرق السوس؟",
"تغسل ايدك مرة في الشهر او تغسل ايدك كل خمس دقايق",
"لو خيروك بين إنقاذ نفسك أو إنقاذ شخص وقد يعرضك ذلك للأذى.",
"لو خيروك |  بين الرقص على سطح منزلك أو الغناء على نافذتك؟",
"لو خيروك |  بين تناول الشوكولا التي تفضلها لكن مع إضافة رشة من الملح والقليل من عصير الليمون إليها أو تناول ليمونة كاملة كبيرة الحجم؟",
"تلاقي اي حاجة تضيع منك او تفتكر كل حاجة تنساها",
"لو خيروك بين أن تعيش 5 دقائق في الماضي أو أن تعيشها في المستقبل.",
"لو خيروك |  بين سائق سيارة يقودها ببطء وبين سائق يقودها بسرعة كبيرة؟",
"لو خيروك بين المال أو الجمال.",
"تمشي في الغابة او تمشي في شارع زحمة",
"لو خيروك |  بين امتلاك أفضل وأجمل منزل ولكن في حي سيء أو امتلاك أسوأ منزل ولكن في حي جيد وجميل؟",
"لو خيروك |  بين أن تعيش بدون موسيقى أبدًا أو أن تعيش بدون تلفاز أبدًا؟",
"تخسر كرامتك وتكسب الحب او تكسب الحب وتخسر كرامتك",
"لــو خــيروك بــين الــقــدرة عــلــى ســمــاع أفــكار الــنــاس أو الــقــدرة عــلــى الــعــودة فــي الــزمــن لــلــخــلــفــ.",
"لو خيروك |  بين أن تكون الشخص الأكثر شعبية في العمل أو المدرسة وبين أن تكون الشخص الأكثر ذكاءً؟",
"لو خيروك بين فقدان ذاكرتك والعيش مع أصدقائك وأقربائك أو بقاء ذاكرتك ولكن العيش وحيد.",
"تمثل انك مجنون ليوم كامل او توقف حد ف الشارع وتطلب منه جنيه",
"لو خيروك |  بين وضع أحمر الشفاه على وجهك ما عدا شفتين أو وضع ماسكارا على شفتين فقط؟",
"لو خيروك |  أن تعيش قصة فيلم هل تختار الأكشن أو الكوميديا؟",
"لو خيروك بين أن تعيش في القرن الرابع عشر أو القرن الحالي.",
"تكمل مع حد بتحبه بس مبيخلفش او تكون مع حد مش بتحبه بس بيخلف",
"لو خيروك |  بين أن تعرف متى سوف تموت أو أن تعرف كيف سوف تموت؟",
"لو خيروك |  بين امتلاك قطة أو كلب؟",
"لو خيروك |  بين معاركة دب أو بين مصارعة تمساح؟",
"لو خيروك |  بين أن تكون اللاعب الأفضل في فريق كرة فاشل أو أن تكون لاعب عادي في فريق كرة ناجح؟",
"لو خيروك |  بين مشاهدة الدراما في أيام السبعينيات أو مشاهدة الأعمال الدرامية للوقت الحالي؟",
"لو خيروك |  بين العمل الذي تحلم به أو بين إيجاد شريك حياتك وحبك الحقيقي؟",
"لو خيروك |  بين أن تتعطل سيارتك في نصف الطريق أو ألا تتمكنين من ركنها بطريقة صحيحة؟",
"لو خيروك |  بين العمل الذي تحلم به أو بين إيجاد شريك حياتك وحبك الحقيقي؟" 
             ]
      
@Client.on_message(filters.command(["خيروك","خيرني","❤️‍🔥خيرني","لو خيروك","خيرنى","خيروك","• لو خيروك •"], ""), group=67656461)
async def krok(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(lkk)
    await message.reply(f"**[{a}]({soesh})**")
    
msl = [
"ضربني وبكى سبقني واشتكى",
"البحر يحب الزيادة",
"↢ أكمل المثل ↢ { اضحك للدنيا ...؟ }",
"ضربني وبكى سبقني واشتكى",
"البحر يحب الزيادة",
"عشمني بالحلق خرمت انا وداني",
"ملقوش العيش ياكلوه جابو لهم عبد يلطشوه",
"ضرب الحبيب زي اكل الزبيب",
"اللي يحبه ربه يحبب فيه خلقه",
"عاكس القطة تخربشك",
"⌔︙اسرع واحد يكمل المثل ~ {مع من قلةشدو على الچلاب سروج يا}",
"من عاشر القوم اربعين يوما ياصار منهم ياصارو منه",
"كثرة المتاعب تفرق الاحباب",
"ضرب الحبيب زي اكل الزبيب",
"اجري جري الوحوش غير رزقك لن تحوش",
"↢ أكمل المثل ↢ { الخبر اللي النهاردة بفلوس ...؟ }",
"كثرة المتاعب تفرق الاحباب",
"تروح فين الشمس من على قفا الفلاح",
"سكتنا له دخل بحماره",
"يعمل من الحبة قبة",
"لاقيني ولا تغديني",
"عصفور في اليد ولا عشرة على الشجرة",
"ان دبلت الوردة ريحتها فيها",
"ضربني وبكى سبقني واشتكى",
"↢ أكمل المثل ↢ { اذا فات الفوت ماينفع ...؟ }",
"جحر ديب يساع مية حبيب",
"⌔︙اسرع واحد يكمل المثل ~ {بالحصاد}",
"عاكس القطة تخربشك",
"خالف تُعرف",
"↢ أكمل المثل ↢ { اذا فات الفوت ماينفع ...؟ }",
"أعمى ويقول شفت بعيني",
"امشي عدل يحتار عدوك فيك",
"↢ أكمل المثل ↢ { مصائب قوم عند قوم ...؟ }*",
"جحر ديب يساع مية حبيب",
"علمناهم الشحاتة سبقونا ع الابواب",
"اللي يكرهه ربنا يسلط عليه لسانه",
"خالف تُعرف",
"↢ أكمل المثل ↢ { تحت السواهي ...؟ }",
"↢ أكمل المثل ↢ { الوقت كالسيف ان لم تقطعه ...؟ }",
"البقرة لما تقع تكتر سكاكينها",
"↢ أكمل المثل ↢ { الخبر اللي النهاردة بفلوس ...؟ }*",
"↢ أكمل المثل ↢ { الخبر اللي النهاردة بفلوس ...؟ }*",
"⌔︙اسرع واحد يكمل المثل ~ {امشيولا تعبر نهر}",
"↢ أكمل المثل ↢ { رب أخ لي لم تلده أمي ينفي الأذى عني ويجلو ..؟ }",
"البيت بيت ابونا ويجو الغرب يطردونا",
"↢ أكمل المثل ↢ { تحت السواهي ...؟ }",
"↢ أكمل المثل ↢ { من عاشر حكيمًا مات ...؟ }",
"اصرف مافي الجيب يأتيك مافي الغيب",
"كل تأخيرة وفيها خيرة",
"↢ أكمل المثل ↢ { إن المعارف في أهل النهى ...؟ }",
"اللي يحبه ربه يحبب فيه خلقه",
"↢ أكمل المثل ↢ { مصائب قوم عند قوم ...؟ }*",
"من جاور الحداد انكوى بناره",
"كثرة المتاعب تفرق الاحباب",
"حرص ولا تخون*",
"الخسارة تعلم الشطارة",
"↢ أكمل المثل ↢ { إن المعارف في أهل النهى ...؟ }",
"جت الحزينة تفرح مالقتلهاش مطرح",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"ضرب الحبيب زي اكل الزبيب",
"اللي يربط في رقبته حبل الف من يسحبه",
"↢ أكمل المثل ↢ { إن المعارف في أهل النهى ...؟ }",
"كثرة المتاعب تفرق الاحباب",
"⌔︙اسرع واحد يكمل المثل ~ {ينطيللماعده سنون}",
"العبد في التفكير والرب في التدبير",
"امشي عدل يحتار عدوك فيك",
"↢ أكمل المثل ↢ { من دق الباب سمع ...؟ }",
"اللي ميشوفش من الغربال يبقا اعمى",
"الرجل تدب مطرح ماتحب",
"اتصالحت المقشة مع البلاعة والاتنين بقو جماعة",
"البقرة لما تقع تكتر سكاكينها",
"ضربني وبكى سبقني واشتكى",
"↢ أكمل المثل ↢ { الخبر اللي النهاردة بفلوس ...؟ }*",
"↢ أكمل المثل ↢ { إذا ضربت فأوجع فإن الملامة ...؟ }",
"قل له في وشه ولا تغشه",
"اصرف مافي الجيب يأتيك مافي الغيب",
"العبد في التفكير والرب في التدبير",
"يعمل من الحبة قبة",
"اللي بيته من قزاز ميحدفش الناس بالطوب",
"اللي يحبه ربه يحبب فيه خلقه",
"متخافش من الهبلة خاف من خلفتها",
"عاكس القطة تخربشك",
"متخافش من الهبلة خاف من خلفتها",
"جحر ديب يساع مية حبيب",
"⌔︙اسرع واحد يكمل المثل ~ {يامن تعب يامنيا من على الحاضر لكة}",
"طول البال يعد الجبال",
"اصرف مافي الجيب يأتيك مافي الغيب",
"⌔︙اسرع واحد يكمل المثل ~ {يامن تعب يامنيا من على الحاضر لكة}",
"مش كل مرة تسلم الجرة",
"اتصالحت المقشة مع البلاعة والاتنين بقو جماعة",
"ادي العيش لخبازه ولو اكل نصه",
"↢ أكمل المثل ↢ { الوقت كالسيف ان لم تقطعه ...؟ }",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"طول البال يعد الجبال",
"كل واحد ينام على الجنب اللي يريحه",
"ملقوش العيش ياكلوه جابو لهم عبد يلطشوه",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"عشمني بالحلق خرمت انا وداني",
"اجري جري الوحوش غير رزقك لن تحوش",
"ايد لوحدها متسقفش",
"الدنيا مرايه وريها توريك",
"⌔︙اسرع واحد يكمل المثل ~ {يامن تعب يامنيا من على الحاضر لكة}",
"ياما جاب الغراب لامه",
"اتقل عالرز يستوي",
"البقرة لما تقع تكتر سكاكينها",
"↢ أكمل المثل ↢ { اذا ماطاعك الزمن ...؟ }",
"↢ أكمل المثل ↢ { اذا كبر إبنك ...؟ }",
"لاقيني ولا تغديني",
"↢ أكمل المثل ↢ { العين بصيره واليد ...؟ }",
"↢ أكمل المثل ↢ { اذا ماطاعك الزمن ...؟ }",
"ضرب الحبيب زي اكل الزبيب",
"↢ أكمل المثل ↢ { اذا فات الفوت ماينفع ...؟ }",
"ضربني وبكى سبقني واشتكى",
"⌔︙اسرع واحد يكمل المثل ~ {قرد}",
"اتصالحت المقشة مع البلاعة والاتنين بقو جماعة",
"ان كنتم نسيتو اللي جرى هاتو الدفاتر تنقرا",
"↢ أكمل المثل ↢ { اضحك للدنيا ...؟ }",
"من عاشر القوم اربعين يوما ياصار منهم ياصارو منه",
"خنفسة شافت ولادها عالحيط قالت دا لولي وملضوم في خيط",
"طول البال يعد الجبال",
"البقرة لما تقع تكتر سكاكينها",
"⌔︙اسرع واحد يكمل المثل ~ {ينطيللماعده سنون}",
"البقرة لما تقع تكتر سكاكينها",
"↢ أكمل المثل ↢ { الخبر اللي النهاردة بفلوس ...؟ }", 
"↢ أكمل المثل ↢ { الوقت كالسيف ان لم تقطعه ...؟ }",
"العبد في التفكير والرب في التدبير",
"اللي بيته من قزاز ميحدفش الناس بالطوب",
"ان كنتم نسيتو اللي جرى هاتو الدفاتر تنقرا",
"يقتل القتيل ويمشي في جنازته",
"من عاشر القوم اربعين يوما ياصار منهم ياصارو منه",
"مش كل مرة تسلم الجرة",
"خنفسة شافت ولادها عالحيط قالت دا لولي وملضوم في خيط",
"من غربل الناس نخلوه",
"يقتل القتيل ويمشي في جنازته",
"من جاور الحداد انكوى بناره",
"البقرة لما تقع تكتر سكاكينها",
"↢ أكمل المثل ↢ { إذا ضربت فأوجع فإن الملامة ...؟ }",
"جحر ديب يساع مية حبيب",
"امشي عدل يحتار عدوك فيك",
"كل اللي يعجبك والبس اللي يعجب الناس",
"اللي يكرهه ربنا يسلط عليه لسانه",
"البحر يحب الزيادة",
"عاكس القطة تخربشك",
"لاقيني ولا تغديني",
"اللي ميشوفش من الغربال يبقا اعمى",
"كل واحد ينام على الجنب اللي يريحه",
"ايش ياخد الريح من البلاط",
"ادي العيش لخبازه ولو اكل نصه",
"ملقوش العيش ياكلوه جابو لهم عبد يلطشوه",
"↢ أكمل المثل ↢ { مصائب قوم عند قوم ...؟ }*",
"اللي يحبه ربه يحبب فيه خلقه",
"↢ أكمل المثل ↢ { القرد بعين امه ...؟ }",
"↢ أكمل المثل ↢ { دق الحديد وهو ...؟ }",
"قد النملة ويعمل عملة*",
"تروح فين الشمس من على قفا الفلاح",
"اسد عليا وفي الحروب نعامة",
"⌔︙اسرع واحد يكمل المثل ~ {قرد}",
"كل تأخيرة وفيها خيرة",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"جحر ديب يساع مية حبيب",
"↢ أكمل المثل ↢ { كرامة العبد من كرامة ...؟ }",
"↢ أكمل المثل ↢ { تحت السواهي ...؟ }",
"↢ أكمل المثل ↢ { اذا فات الفوت ماينفع ...؟ }",
"البقرة لما تقع تكتر سكاكينها",
"اللي يحبه ربه يحبب فيه خلقه",
"↢ أكمل المثل ↢ { رب أخ لي لم تلده أمي ينفي الأذى عني ويجلو ..؟ }"
            ]
      
@Client.on_message(filters.command(["مثل","امثله","امثلة","• امثله •"], ""), group=67547861)
async def amsla(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(msl)
    await message.reply(f"**[{a}]({soesh})**")
    
txt = [
"عامل الناس بأخلاقك ولا بأخلاقهم", 
"الجمال يلفت الأنظار لكن الطيبه تلفت القلوب ", 
"الاعتذار عن الأخطاء لا يجرح كرامتك بل يجعلك كبير في نظر الناس ",
"لا ترجي السماحه من بخيل.. فما في البار لظمان ماء",
"لا تحقرون صغيره إن الجبال من الحصي",
"لا تستحي من إعطاء فإن الحرمان أقل منه ", 
"لا تظلم حتى لا تتظلم ",
"لا تقف قصاد الريح ولا تمشي معها ",
"لا تكسب موده التحكم الا بالتعقل",
"لا تمد عينك في يد غيرك ",
"لا تملح الا لمن يستحقاها ويحافظ عليها",
"لا حياه للإنسان بلا نبات",
"لا حياه في الرزق.. ولا شفاعه في الموت",
"كما تدين تدان",
"لا دين لمن لا عهد له ",
"لا سلطان على الدوق فيما يحب أو بكره",
"لا مروه لمن لادين له ",
"لا يدخل الجنه من لايأمن من جازه بوائقه",
"يسروا ولا تعسروا... ويشورا ولا تنفروا",
"يدهم الصدر ما يبني العقل الواسع ",
"أثقل ما يوضع في الميزان يوم القيامة حسن الخلق ",
"أجهل الناس من ترك يقين ما عنده لظن ما عند الناس ",
"أحياناً.. ويصبح الوهم حقيقه ",
"مينفعش تعاتب حد مبيعملش حساب لزعلك عشان متزعلش مرتين . ",
"السفر ومشاهده اماكن مختلفه وجديده ",
"عدم تضيع الفرص واسثمارها لحظه مجبئها ",
" اعطاء الاخرين اكثر من ما يتوقعون",
"معامله الناس بلطف ولكن عدم السماح لاحد بستغالال ذالك ",
"تكوين صدقات جديده مع الحفظ بلاصدقاء القودامي ",
"تعلم اصول المهنه بدلا من تضيع الوقت ف تعلم حيل المهنه ",
"مدح ع الاقل ثلاث اشخاص يوميا ",
"النظر ف عيون الشخاص عند مخاطبتهم ",
"التحلي بلسماح مع الاخرين او النفس ",
"الاكثار من قول كلمه شكرا ",
" مصافحه الاخرين بثبات وقوة ",
"الابتعاد عن المناطق السيئه السمعه لتجنب الاحداث السئه ",
" ادخار 10٪ع الاقل من الدخل",
" تجنب المخاوف من خلال التعلم من تجارب مختلفه",
" الحفاظ ع السمعه لانها اغلي ما يملك الانسان",
" تحويل الاعداء الي اصدقاء من خلال القيام بعمل جيد",
"لا تصدق كل ما تسمعع. ولا تنفق كل ما تمتلك . ولا تنم قدر ما ترغب ",
" اعتني بسمعتك جيدا فستثبت للك الايام انها اغلي ما تملك",
"حين تقول والدتك ستندم ع فعل ذالك ستندم عليه غالبا.. ",
" لا تخش العقبات الكبيره فخلفها تقع الفرص العظيمه",
"قد لا يتطلب الامر اكثر من شخص واحد لقلب حياتك رأس ع عقب ",
"اختر رفيقه حياتك بحرص فهو قرار سيشكل 90٪من سعادتك او بؤسك ",
" اقلب اداءك الاصدقاء بفعل شي جميل ومفجائ لهم",
"حين تدق الفرصه ع باباك ادعوها للبيت ",
"تعلم القواعد جيدا ثن اكسر بعدها ",
"احكم ع نجاحك من خلال قدرتك ع العطاء وليس الاخذ ",
" لا تتجاهل الشيطان مهما بدل ثيابه",
"ركز ع جعل الاشياء افضل وليس اكبر او اعظم ",
"كن سعيد  بما تمتلك واعمل لامتلاك ما تريد ",
"اعط الناس اكثر من ما يتوقعون ",
" لا تكن منشغل لدرجه عدم التعرف ع اصدقاء جدد",
"استحمه يوم العيد يمعفن🐰",
"مش تحب اي حد يقرب منك ",
" خليك مع البت راجل خليك تقيل",
" انصح نفسك بنفسك بمت😂",
" كنت نصحت نفسي ياخويا🗿", 
        ]
      
@Client.on_message(filters.command(["انصحني","❤️‍🔥انصحني","نصيحه","انصحنى","• انصحني •"], ""), group=6736961)
async def anshny(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(txt)
    await message.reply(f"**[{a}]({soesh})**")
        
tt = [
" اسم ولد بحرف ⇦ أ  ",
"  اسم بنت بحرف ⇦ أ  ",
"  جماد بحرف ⇦ أ  ",
" نبات بحرف ⇦ أ  ",
" حيوان بحرف ⇦ أ  ",
"مدينة او بلد بحرف ⇦ أ  ",
" اسم ولد بحرف ⇦ ب  ",
"  اسم بنت بحرف ⇦ ب  ",
"  جماد بحرف ⇦ ب  ",
" نبات بحرف ⇦ ب ",
" حيوان بحرف ⇦ ب ",
"مدينة بحرف ⇦ ب ",
" اسم ولد بحرف ⇦ ت  ",
"  اسم بنت بحرف ⇦ ت  ",
"  جماد بحرف ⇦ ت  ",
" نبات بحرف ⇦ ت ",
" حيوان بحرف ⇦ ت",
"مدينة بحرف ⇦ ت ",
" اسم ولد بحرف ⇦ ث  ",
"  اسم بنت بحرف ⇦ ث ",
"  جماد بحرف ⇦ ث ",
" نبات بحرف ⇦ ث  ",
" حيوان بحرف ⇦ ث ",
"مدينة او بلد بحرف ⇦ ث ",
" اسم ولد بحرف ⇦ ج  ",
"  اسم بنت بحرف ⇦ ج  ",
"  جماد بحرف ⇦ ج  ",
" نبات بحرف ⇦ ج  ",
" حيوان بحرف ⇦ ج ",
"مدينة او بلد بحرف ⇦ ج  ",
" اسم ولد بحرف ⇦ ح ",
"  اسم بنت بحرف ⇦ ح  ",
"  جماد بحرف ⇦ ح  ",
" نبات بحرف ⇦ ح  ",
" حيوان بحرف ⇦ ح ",
"مدينة او بلد بحرف ⇦ ح ",
" اسم ولد بحرف ⇦ خ ",
"  اسم بنت بحرف ⇦ خ  ",
"  جماد بحرف ⇦ خ  ",
" نبات بحرف ⇦ خ ",
" حيوان بحرف ⇦ خ ",
"مدينة او بلد بحرف ⇦ خ  ",
" اسم ولد بحرف ⇦ د  ",
"  اسم بنت بحرف ⇦ د ",
"  جماد بحرف ⇦ د  ",
" نبات بحرف ⇦ د ",
" حيوان بحرف ⇦ د  ",
"مدينة او بلد بحرف ⇦ د  ",
" اسم ولد بحرف ⇦ ذ  ",
"  اسم بنت بحرف ⇦ ذ  ",
"  جماد بحرف ⇦ ذ ",
" نبات بحرف ⇦ ذ ",
" حيوان بحرف ⇦ ذ ",
"مدينة او بلد بحرف ⇦ ذ  ", 
" اسم ولد بحرف ⇦ ر  ",
"  اسم بنت بحرف ⇦ ر ",
"  جماد بحرف ⇦ ر  ",
" نبات بحرف ⇦ ر ",
" حيوان بحرف ⇦ ر  ",
"مدينة او بلد بحرف ⇦ ر ",
" اسم ولد بحرف ⇦ ز ",
"  اسم بنت بحرف ⇦ ز ",
"  جماد بحرف ⇦ ز  ",
" نبات بحرف ⇦ ز  ",
" حيوان بحرف ⇦ ز  ",
"مدينة او بلد بحرف ⇦ ز  ",
" اسم ولد بحرف ⇦ س ",
"  اسم بنت بحرف ⇦ س  ",
"  جماد بحرف ⇦ س  ",
" نبات بحرف ⇦ س  ",
" حيوان بحرف ⇦ س  ",
"مدينة او بلد بحرف ⇦ س  ",
" اسم ولد بحرف ⇦ ش  ",
"  اسم بنت بحرف ⇦ ش  ",
"  جماد بحرف ⇦ ش  ",
" نبات بحرف ⇦ ش  ",
" حيوان بحرف ⇦ ش  ",
"مدينة او بلد بحرف ⇦ ش  ",
" اسم ولد بحرف ⇦ ص  ",
"  اسم بنت بحرف ⇦ ص  ",
"  جماد بحرف ⇦ ص  ",
" نبات بحرف ⇦ ص  ",
" حيوان بحرف ⇦ ص  ",
"مدينة او بلد بحرف ⇦ ص  ",
" اسم ولد بحرف ⇦ ض  ",
"  اسم بنت بحرف ⇦ ض  ",
"  جماد بحرف ⇦ ض  ",
" نبات بحرف ⇦ ض  ",
" حيوان بحرف ⇦ ض  ",
"مدينة او بلد بحرف ⇦ ض  ", 
" اسم ولد بحرف ⇦ ط  ",
"  اسم بنت بحرف ⇦ ط  ",
"  جماد بحرف ⇦ ط  ",
" نبات بحرف ⇦ ط  ",
" حيوان بحرف ⇦ ط  ",
"مدينة او بلد بحرف ⇦ ط  ",
" اسم ولد بحرف ⇦ ظ  ",
"  اسم بنت بحرف ⇦ ظ  ",
"  جماد بحرف ⇦ ظ  ",
" نبات بحرف ⇦ ظ  ",
" حيوان بحرف ⇦ ظ  ",
"مدينة او بلد بحرف ⇦ ظ  ",
" اسم ولد بحرف ⇦ ع ",
"  اسم بنت بحرف ⇦ ع  ",
"  جماد بحرف ⇦ ع  ",
" نبات بحرف ⇦ ع  ",
" حيوان بحرف ⇦ ع  ",
"مدينة او بلد بحرف ⇦ ع  ",
" اسم ولد بحرف ⇦ غ. ",
"  اسم بنت بحرف ⇦ غ  ",
"  جماد بحرف ⇦ غ  ",
" نبات بحرف ⇦ غ  ",
" حيوان بحرف ⇦ غ  ",
"مدينة او بلد بحرف ⇦ غ  ",
" اسم ولد بحرف ⇦ ف  ",
"  اسم بنت بحرف ⇦ ف  ",
"  جماد بحرف ⇦ ف  ",
" نبات بحرف ⇦ ف  ",
" حيوان بحرف ⇦ ف  ",
"مدينة او بلد بحرف ⇦ ف  ",
" اسم ولد بحرف ⇦ ق  ",
"  اسم بنت بحرف ⇦ ق  ",
"  جماد بحرف ⇦ ق  ",
" نبات بحرف ⇦ ق  ",
" حيوان بحرف ⇦ ق  ",
"مدينة او بلد بحرف ⇦ ق  ",
" اسم ولد بحرف ⇦ ك  ",
"  اسم بنت بحرف ⇦ ك  ",
"  جماد بحرف ⇦ ك ",
" نبات بحرف ⇦ ك ",
" حيوان بحرف ⇦ ك  ",
"مدينة او بلد بحرف ⇦ ك  ",
" اسم ولد بحرف ⇦ ل  ",
"  اسم بنت بحرف ⇦ ل  ",
"  جماد بحرف ⇦ ل  ",
" نبات بحرف ⇦ ل  ",
" حيوان بحرف ⇦ ل  ",
"مدينة او بلد بحرف ⇦ ل  ", 
" اسم ولد بحرف ⇦ م  ",
"  اسم بنت بحرف ⇦ م  ",
"  جماد بحرف ⇦ م  ",
" نبات بحرف ⇦ م  ",
" حيوان بحرف ⇦ م  ",
"مدينة او بلد بحرف ⇦ م  ",
" اسم ولد بحرف ⇦ ن  ",
"  اسم بنت بحرف ⇦ ن ",
"  جماد بحرف ⇦ ن  ",
" نبات بحرف ⇦ ن  ",
" حيوان بحرف ⇦ ن  ",
"مدينة او بلد بحرف ⇦ ن  ",
" اسم ولد بحرف ⇦ ه  ",
"  اسم بنت بحرف ⇦ ه ",
"  جماد بحرف ⇦ ه  ",
" نبات بحرف ⇦ ه  ",
" حيوان بحرف ⇦ ه  ",
"مدينة او بلد بحرف ⇦ ه  ",
" اسم ولد بحرف ⇦ و  ",
"  اسم بنت بحرف ⇦ و  ",
"  جماد بحرف ⇦ و  ",
" نبات بحرف ⇦ و  ",
" حيوان بحرف ⇦ و  ",
"مدينة او بلد بحرف ⇦ و  ",
" اسم ولد بحرف ⇦ ي ",
"  اسم بنت بحرف ⇦ ي  ",
"  جماد بحرف ⇦ ي  ",
" نبات بحرف ⇦ ي  ",
" حيوان بحرف ⇦ ي  ",
"مدينة او بلد بحرف ⇦ ي  "
        ]
@Client.on_message(filters.command(["حروف","❤️‍🔥حروف","حرف","اتوبيس كومبليت","• حروف •"], ""), group=158007) 
async def ahrof(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(tt)
    await message.reply(f"**[{a}]({soesh})**")

xt = ["لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ🌸",
"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ , وَشُكْرِكَ , وَحُسْنِ عِبَادَتِكَ🎈💞",
"استغفر الله العظيم وأتوبُ إليه 🌹",
"حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم"
"ِ سبع مرات، كفاه الله تعالى ما أهمه من أمور الدنيا والآخرة🌹🌸",
"ربنا اغفر لنا ذنوبنا وإسرافنا فِي أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين🌸",
"أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
"سبحان الله وبحمده سبحان الله العظيم🌸",
"أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله🌺",
"اللهم إنك عفو تُحب العفو فاعفُ عنّا 🌿🌹",
"استغفر الله العظيم وأتوبُ إليه 🌹",
"لا تقطع صلاتك، إن كنت قادراً على الصلاة في الوقت فصلِي و أكثر من الدعاء لتحقيق ما تتمنى💙",
"قال ﷺ : ”حَيْثُمَا كُنْتُمْ فَصَلُّوا عَلَيَّ، فَإِنَّ صَلَاتَكُمْ تَبْلُغُنِي“.",
"يا رب أفرحني بشيئاً انتظر حدوثه،اللهم إني متفائلاً بعطائك فاكتب لي ما أتمنى🌸",
"﴿ رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي ﴾",
"‏{ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ }",
"‏اللهّم لطفك بقلوبنا وأحوالنا وأيامنا ،‏اللهّم تولنا بسعتك وعظيم فضلك ",
"ومن أحسن قولاً ممن دعا إلى الله وعمل صالحاً وقال أنني من المسلمين .💕",
"‏إن الله لا يبتليك بشيء إلا وبه خيرٌ لك فقل الحمدلله.",
"رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ",
"اللهم اشفي كل مريض يتألم ولا يعلم بحاله إلا أنت",
"استغفر الله العظيم وأتوبُ إليه.",
"‏لَم تعرف الدنيا عظيماً مِثله صلّوا عليه وسلموا تسليم",
" أنتَ اللّطيف وأنا عبدُك الضّعيف اغفرلي وارحمني وتجاوز عنّي.",
"ماتستغفر ربنا كده🥺❤️",
"فاضي شويه نصلي ع النبي ونحز خته فى الجنه❤️❤️",
"ماتوحدو ربنا يجماعه قولو لا اله الا الله❤️❤️",
"يلا كل واحد يقول سبحان الله وبحمده سبحان الله العظيم 3 مرات🙄❤️",
"قول لاحول ولا قوه الا بالله يمكن تفك كربتك🥺❤️",
"اللهم صلي عللى سيدنا محمد ماتصلي على النبي كده",
"- أسهل الطرق لإرضاء ربك، أرضي والديك 🥺💕",
"- اللهُم صبراً ، اللهم جبراً ، اللهم قوّة",
"أصبحنا وأصبح الملك لله ولا اله الا الله.",
"‏إنَّ اللهَ يُحِبُ المُلحِينَ فِي الدُّعَاء.",
"‏إن الله لا يخذل يداً رُفعت إليه أبداً.",
"يارب دُعاء القلب انت تسمعه فأستجب لهُ.",
"- اللهم القبول الذي لا يزول ❤️🍀.",
"- اللهُم خذ بقلبّي حيث نورك الذي لا ينطفِئ.",
"سبحان الله وبحمده ،سبحان الله العظيم.",
"لا تعودوا أنفسكم على الصمت، اذكرو الله، استغفروه، سبّحوه، احمدوه،"
" عودوا السنتكم على الذكر فإنها إن اعتادت لن تصمت أبدًا.",
"- اللهم بلغنا رمضان وأجعلنا نختم القرآن واهدنا لبر الامان يالله يا رحمان 🌙",
"بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العلي- ثلاث مرات -",
"- اللهم احرمني لذة معصيتك وارزقني لذة طاعتك 🌿💜.",
"- اللهُم إن في صوتي دُعاء وفي قلبِي أمنية اللهُم يسر لي الخير حيث كان.",
"‏اللهم أرني عجائب قدرتك في تيسير أموري 💜.",
"يغفر لمن يشاء إجعلني ممن تشاء يا الله.*",
"‏يارب إن قصّرنا في عبادتك فاغفرلنا، وإن سهينا عنك بمفاتن الدنيا فردنا إليك رداً جميلاً 💜🍀",
"صلوا على من قال في خطبة الوداع  ‏و إني مُباهٍ بكم الأمم يوم القيامة♥️⛅️",
"اللهـم إجعلنا ممن تشهد أصابعهم بذكـر الشهادة قبل الموت ??💜.",
"- وبك أصبحنا يا عظيم الشأن ??❤️.",
"اللهُم الجنة ونعيَّم الجنة مع من نحب💫❤️🌹",
"‏اللهم قلبًا سليمًا عفيفًا تقيًا نقيًا يخشاك سرًا وعلانية🤍🌱",
"- أسجِد لربِك وأحضِن الارض فِي ذِ  لاضَاق صَدرِك مِن هَموم المعَاصِي 🌿.",
"صلي على النبي بنيه الفرج❤️",
"استغفر ربنا كده 3 مرات هتاخد ثواب كبير اوى❤️",
"اشهد ان لا اله الا الله وان محمدا عبده ورسوله",
"لا اله الا الله سيدنا محمد رسول الله🌿💜",
"قول معايا - استغفر الله استفر الله استغفر الله -",
"مُجرد ثانية تنفعِك : أستغفُرالله العظيِم وأتوب إليّه.",
"أدعُ دُعاء الواثِق فالله لايُجرّبُ معه‌‏",
"صلي على محمد❤️",
"ماتيجو نقرء الفاتحه سوا🥺"]

@Client.on_message(filters.command(["ازكار","الازكار","❤️‍🔥ازكار","دينى","اسلامى","• ازكار •"], ""), group=694771) 
async def azkar(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(xt)
    await message.reply(f"**[{a}]({soesh})**")
        
txkt = [

"‏من علامات جمال المرأة .. بختها المايل ! ",
"‏ انك الجميع و كل من احتل قلبي🫀🤍",
"‏ ‏ لقد تْعَمقتُ بكَ كَثيراً والمِيمُ لام .♥️",
"‏ ‏ممكن اكون اختارت غلط بس والله حبيت بجد🖇️",
"‏ علينا إحياء زَمن الرّسائل الورقيّة وسط هذه الفوضى الالكترونية العَارمة. ℘︙ 💜",
"‏ يجي اي الصاروخ الصيني ده جمب الصاروخ المصري لما بيلبس العبايه السوده.🤩♥️",
"‏ كُنت أرقّ من أن أتحمّل كُل تلك القَسوة من عَينيك .🍍",
"‏أَكَان عَلَيَّ أَنْ أغْرَس انيابي فِي قَلْبِك لتشعر بِي ؟.",
"‏ : كُلما أتبع قلبي يدلني إليك .",
"‏ : أيا ليت من تَهواه العينُ تلقاهُ .",
"‏ ‏: رغبتي في مُعانقتك عميقة جداً .??",
"ويُرهقني أنّي مليء بما لا أستطيع قوله.✨",
"‏ من مراتب التعاسه إطالة الندم ع شيء إنتهى. ℘︙ ",
"‏ ‏كل العالم يهون بس الدنيا بينا تصفي 💙",
"‏ بعض الاِعتذارات يجب أن تُرفَضّ.",
"‏ ‏تبدأ حياتك محاولاً فهم كل شيء، وتنهيها محاولاً النجاة من كل ما فهمت.",
"‏ إن الأمر ينتهي بِنا إلى أعتياد أي شيء.",
"‏ هل كانت كل الطرق تؤدي إليكِ، أم أنني كنتُ أجعلها كذلك.",
"‏ ‏هَتفضل تواسيهُم واحد ورا التاني لكن أنتَ هتتنسي ومحدِش هَيواسيك.",
"‏ جَبَرَ الله قلوبِكُم ، وقَلبِي .🍫",
"‏ بس لما أنا ببقى فايق، ببقى أبكم له ودان.💖",
"‏ ‏مقدرش عالنسيان ولو طال الزمن 🖤",
"‏ أنا لستُ لأحد ولا احد لي ، أنا إنسان غريب أساعد من يحتاجني واختفي.",
"‏ ‏أحببتك وأنا منطفئ، فما بالك وأنا في كامل توهجي ؟",
"‏ لا تعودني على دفء شمسك، إذا كان في نيتك الغروب .َ",
"‏ وانتهت صداقة الخمس سنوات بموقف.",
"‏ ‏لا تحب أحداً لِدرجة أن تتقبّل أذاه.",
"‏ إنعدام الرّغبة أمام الشّيء الّذي أدمنته ، انتصار.",
"‏مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !?? ",
" مش جايز , ده اكيد التأخير وارهاق القلب ده وراه عوضاً عظيماً !💙",
"فـ بالله صبر  وبالله يسر وبالله عون وبالله كل شيئ ♥️. ",
"أنا بعتز بنفسي جداً كصاحب وشايف اللي بيخسرني ، بيخسر أنضف وأجدع شخص ممكن يشوفه . ",
"فجأه جاتلى قافله ‏خلتنى مستعد أخسر أي حد من غير ما أندم عليه . ",
"‏اللهُم قوني بك حين يقِل صبري... ",
"‏يارب سهِل لنا كُل حاجة شايلين هَمها 💙‏ ",
"انا محتاج ايام حلوه بقي عشان مش نافع كدا ! ",
"المشكله مش اني باخد قررات غلط المشكله اني بفكر كويس فيها قبل ما اخدها .. ",
"تخيل وانت قاعد مخنوق كدا بتفكر فالمزاكره اللي مزكرتهاش تلاقي قرار الغاء الدراسه .. ",
" مكانوش يستحقوا المعافرة بأمانه.",
"‏جمل فترة في حياتي، كانت مع اكثر الناس الذين أذتني نفسيًا. ",
" ‏إحنا ليه مبنتحبش يعني فينا اي وحش!",
"أيام مُمله ومستقبل مجهول ونومٌ غير منتظموالأيامُ تمرُ ولا شيَ يتغير ", 
"عندما تهب ريح المصلحه سوف ياتي الجميع رتكدون تحت قدمك ❤️. ",
"عادي مهما تعادي اختك قد الدنيا ف عادي ❤. ",
"بقيت لوحدي بمعنا اي انا اصلا من زمان لوحدي.❤️ ",
"- ‏تجري حياتنا بما لاتشتهي أحلامنا ! ",
"تحملين كل هذا الجمال، ‏ألا تتعبين؟",
"البدايات للكل ، والثبات للصادقين ",
"مُؤخرًا اقتنعت بالجملة دي جدا : Private life always wins. ",
" الافراط في التسامح بيخللي الناس تستهين بيك🍍",
"مهما كنت كويس فـَ إنت معرض لـِ الاستبدال.. ",
"فخوره بنفسي جدًا رغم اني معملتش حاجه فـ حياتي تستحق الذكر والله . ",
"‏إسمها ليلة القدر لأنها تُغير الأقدار ,اللهُمَّ غير قدري لحالٍ تُحبه وعوضني خير .. ",
"فى احتمال كبير انها ليلة القدر ادعوا لنفسكم كتير وأدعو ربنا يشفى كل مريض. 💙 ",
"أنِر ظُلمتي، وامحُ خطيئتي، واقبل توبتي وأعتِق رقبتي يا اللّٰه. إنكَ عفوٌّ تُحِبُّ العفوَ؛ فاعفُ عني 💛 "
        ]
        
@Client.on_message(filters.command(["كتبات","حكمه","❤️‍🔥حكمه","• اقتباسات •","اقتباسات","مقوله","معلومات","❤️‍🔥اقتباسات","اقتباس","تويت","تويته","• تويت •"], ""), group=7397473) 
async def ktbat(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(txkt)
    await message.reply(f"**[{a}]({soesh})**")
        
thdhbxt = [
"هل تخربني اسم والدتك ما هو.",
"ليك اسم شهره بتحبو ؟",
"ممكن تعمل اي في حياتك",                        
"انت راضي عن حياتك",            
"اسم حببتك الاوله ايه",           
"ما هو هدفك في الحياه",
"كم مجموعك الدراسي",                      
"ما هو الاكل المفضل لك",            
"هل تحب سماع القران الكريم",           
"هل تامن بالحب",
"ماهو اخطر سر اليك",                    
"هل تامن بالارتباط السوشيال",                       
"متي ستتزوج",                        
"هل تحب الفتيات ام الصبيان",                        
"ماهو قولك عندما تره ما تحب",          
"مانوع هاتفك الجوال",            
"ماذا تفعل في الشتاء",                        
"هل تحب والديك ام خوتك",                       
"هل لك اسم شهره",                        
"سبق و فعلت شي ندمان علي فعله",           
"ما هو هدفك في الوقت الحالي",                        
"ما اسم فلمك المفضل",                        
"هل تحب الصراحه ام الكذب",                        
"• أوصف نفسك بكلمة؟",                        
"ممكن تقدم نصيحه لاحدهم بعنوان متغلطش غلطتي",           
"تاريخ ميلادك ايه?",                        
"مرتبط ولا سنجل ؟",          
"انت بخير حاليا ؟",           
"اسمك ايه",                        
"منين داهيه",                        
"عندك صحاب بنات",                        
"عندك صحاب ولاد",                       
"لونك المفضل",                       
"جربت حاجه نجحت واي هي ؟",                        
"رايك في البار",                        
"مين اكتر حد بتحبه هنا",                      
"هات رقمك",                        
"بتحب المغامره",              
"احسن حاجه حصلتلك الفتره دي",            
"بتصلي",                        
"كم فرد في الاسلام",                       
"ممكن تقدم نصيحه لاحدهم بعنوان متغلطش غلطتي",                        
"كم ركعه في صلاه العصر",                      
"ما هيا اليلله التي خير من الف شهر",                        
"سرقت قبل كدا",            
"هل تحب الموسيقى",           
"هل تحب مصر",            
"لو الحمه غلت تاكل ايه",           
"ايه رايك فيا كابوت موز",            
"بتحب مين من الفنانين",                        
"امك حلوه",                        
"عندك كم اخ",                        
"تقدر تنصح غيرك",                       
"عاوز تعمل نصيبه امتي",                        
"لابس ايه دلوقتي",                        
"لابسه ايه دلوقتي",                        
"حد باسك قبل كدا",                        
"بوست حد قبل كدا",                        
"بتحب الفلوس",                        
"بتحب الكشري",                        
"نفسك تسافر فيه",                        
"عالطلاق انت كحيااان",                        
"بتعرف ترقص",                       
"بتعرف تغني",                        
"بتحب المدرسه",                        
"ارتبط من المدرسه قبل كدا",                        
"اكتر اتنين بتحب تخرج معاهم",                        
"بتحب الفصح",                     
"بتحب المناسبات",                        
"بتحب الفول",                        
"عاوز تخرج فين",                        
"جربت تموت من الجوع قبل كدا",                        
"بتحب تربي القطط",                        
"مامتك عايشه",                        
"ايه رايك في تليجرام",                        
"ايه رايك في بت اللي فكول دي",                        
"ايه رايك في اسعار في البلد",                       
"ناوي تغير فونك امتي",                       
"تعرف تشتم حد بتحبو",                        
"بتحب الصعيد",                        
"بتحب اسكندريه",                       
"متابع ايه في مسلسلات التركي",                        
"عندك واتساب",                        
"ايه رايك في الشتاء",                       
"ايه رايك في الصيف",                       
"ايه رايك في الخريف",                       
"كم فصل في سنه",                        
"قاعد فين دلوقتي",                        
"شربت حشيش قبل كدا",                       
"بتشرب سجاير",                        
"بتشربي سجاير",                        
"عيط علي حاجه قبل كدا",           
"بتنام امتي",                        
"شغال ايه",                        
"شغاله ايه",                        
"بتحب شغالك",                        
"نفسك تبقي غني",                        
"بتعرف تخبي مشعارك",            
"لون عيونك ايه",            
"لون شعرك ايه",
"حبيت كام مره 💏",             
"اتعاكست كام مره☹️☹️",                
"خونت كام مره 😈",                
"موقف محرج حصلك😳",                
"اكتر شخص حبيته وكسرك💔",                
"شايف نفسك فين  بعد 5 سنين🤑",                
"لو بقيت بنت ليوم اول حاجه هتعملها ايه والعكس لو بقيتي ولد ليوم اول حاجه هتعمليها ايه🤐🤐",                
"اغرب موقف حصلك🤨",                
"اقرب انسان لقلبك 💑",                
"قولي اغلي 5 اشخاص في حياتك 👨‍👩‍👦‍👦",                
"اوصف نفسك في كلمتين👼",                
"لو ليك 3 امنيات هيبقوا ايه 🧚‍♂️🧚‍♀️",                
"اكتر شخص بتحبه هنا مين😍",                
"اوصف صاحب ليك في 3 كلمات😌",                
"عاكست قبل كده وكان مين😘",                
"اتخانت قبل كده ؟🤣",                
"لو اتجبرت علي جواز صالونات هتوافق 👰🤵",                
"لو هترتبط بحد في الروم هيبقي مين ??",                
"اهلك بيدلعوك بيقولولك ايه 😁😁",               
"صوتك حلو؟",                
"لقيت الناس اللي بوشين؟",                
"شيء وكنت تحقق اللسان؟",                
"أنا شخص ضعيف عندما؟",                
"هل ترغب في إظهار حبك ومرفق لشخص أو رؤية هذا الضعف؟",
"هل الكذب يكون ضروري وقتا ما؟",                
"أتشعر بالوحدة على الرغم انه يحاط بك الكثير من البشر؟",                
"كيفية الكشف عن من يكمن عليك؟",               
"إذا حاول شخص ما أن يكرهه أن يقترب منك ويهتم بك تعطيه فرصة؟",                
"أشجع حاجه حلوه ف حياتك؟",                
"طريقة جيدة يقنع حتى لو كانت الفكرة خاطئة"                 
"كيف تتصرف مع من يسيئون فهمك ويأخذ على ذهنه ثم ينتظر أن يرفض؟",                
"التغيير العادي عندما يكون الشخص الذي يحبه؟",               
"المواقف الصعبة تضعف لك ولا ترفع؟",                
"نظرة و يفسد الصداقة؟",                
"‏‏لو حد قالك كلام سئ في الغالب اي رد فعلك؟",                
"شخص معاك بالحلوه والمُره؟",                
"‏هل تحب إظهار حبك وتعلقك بالشخص أم ترى ذلك ضعف؟",                
"تاخد بكلام اللي ينصحك وماتعملش اللي انت عاوزة؟",               
"اي تتمني الناس تعرفه عليك؟",                
"ابيع المجرة عشان؟",                
"أحيانا بحس ان الناس ، كمل؟",                
"صدفة العمر الحلوة هي اني؟",             
"الكُره العظيم دايم يجي بعد حُب قوي "
"صفة تحبها في نفسك؟",               
"‏الفقر فقر العقول ليس الجيوب "                
"تصلي صلواتك الخمس كلها؟",                
"‏تجامل أحد على راحتك؟",                
"اشجع شيء عملته ف حياتك؟",                
"ناوي تعمل اي النهارده؟",                
"اي بيكون شعورك لما بتشوف المطر؟",
"غيرتك هاديه ومابتعملش مشاكل؟",
"اي اكتر حاجه ندمت عليها؟",
"اي الدول اللي تتمنى تزورها؟",
"اخره مره بكيت امتي؟",
"تقييم حظك ؟ من عشره؟",
"هل تعتقد ان حظك سيئ؟",
"شـخــص تتمنــي الإنتقــام منـــه؟",
"كلمة تود سماعها كل يوم؟",
"**هل تُتقن عملك أم تشعر بالممل؟",
"هل قمت بانتحال أحد الشخصيات لتكذب على من حولك؟",
"متى آخر مرة قمت بعمل مُشكلة كبيرة وتسببت في خسائر؟",
"ما هو اسوأ خبر سمعته بحياتك؟",                
"‏ هل جرحت شخص تحبه من قبل ؟",               
"ما هي العادة التي تُحب أن تبتعد عنها؟",
"‏هل تحب عائلتك ام تكرههم؟",
"‏من هو الشخص الذي يأتي في قلبك بعد الله – سبحانه وتعالى- ورسوله الكريم – صلى الله عليه وسلم؟",
"‏هل خجلت من نفسك من قبل؟",                
"‏ما هو ا الحلم الذي لم تستطيع ان تحققه؟",                
"‏ما هو الشخص الذي تحلم به كل ليلة؟",              
"‏هل تعرضت إلى موقف مُحرج جعلك تكره صاحبهُ؟",
"‏هل قمت بالبكاء أمام من تُحب؟",              
"‏ماذا تختار حبيبك أم صديقك؟",               
"‏ هل حياتك سعيدة أم حزينة؟",                
"ما هي أجمل سنة عشتها بحياتك؟",                
"‏ما هو عمرك الحقيقي؟",                
"ما هي أمنياتك المُستقبلية؟"
        ]
       
@Client.on_message(filters.command(["صراحه","اسال","سوال","س","• اسال •","كت","❤️‍🔥كت","• كت •","• صراحه •"], ""), group=7558523)
async def c5455utt(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(thdhbxt)
    await message.reply(f"**[{a}]({soesh})**")
        

tjgkgjhjxt = [
"واحد مشغول أتجوز واحدة مشغولة خلفوا عيل مش فاضيلهم 👻😹",
"مرة القمر كان عايز يتجوز الشمس قالتله أتجوز واحد صايع طول الليل 👻😹",
"ولد بيسأل أبوه هو الحب أعمى رد عليه أبوه بص في وش أمك وأنت تعرف 👻😹",
"مرة مفتاح مات أهله ما زعلوش عليه عشان معاهم نسخة تانية ??😹",
"ممرضة خلفت توأم سمت واحد عضل والتاني وليد 👻😹",
"مسطول أتجوز صينية قالتله مالك ساكت ليه؟ قالها مش عارف افتكرتك نايمة 👻😹",
"واحدة صعيدية جوزها رماها من الدور الثالث طلعتله وقالتله بلاش الهزار البايخ ده 👻😹",
"اتنين مساطيل حبوا يسرقوا عمارة فقالوا لبعض إحنا ناخد العمارة بعيد ونسرقها برحتنا 👻😹",
"منهم بص ورا ملقاش الهدوم فقال له كفاية كدة احنا بعدنا أوى 👻😹",
"حر جدًا، قالتله مفيش مشكلة نطلعها بالليل ??😹",
"واحد رجع في كلامه خبط اللي وراه 👻😹",
"واحد خلقه ضاق أعطاه لأخوه الصغير 👻😹",
"مرة مدرس رياضيات خلف ولدين واستنتج التالت 👻😹",
"واحد كهربائي أتجوز أربعة جابلهم مشترك 👻😹",
"كفايه عليك كده ياد يبن الحلوهه 👻😹",
"واحدة اسمها ساندي دخلت هندسة بقت ساندي متر مربع 👻😹",
"مرة شرطي مرور خلّف ولد بيتكلم بالإشارة 👻😹",
"مره واحد اسمو جابوا  كان بيرجم ابليس ف الحج قالولو ليه؟ قال عشان يمكن احتاجو 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه  👻😹",
"واحد بيشتكي لصاحبه بيقوله أنا مافيش حد بيحبني ولا يفتكرني أبدًا، ومش عارف أعمل إيه قاله سهلة استلف من الناس فلوس هيسألوا عليك كل يوم 👻😹",
" مرة واحد مصري دخل سوبر ماركت في الكويت عشان يشتري ولاعة راح عشان يحاسب بيقوله الولاعة ديه بكام قاله دينار قاله منا عارف ان هي نار بس بكام 👻😹",
"بنت حبت تشتغل مع رئيس عصابة شغلها في غسيل الأموال 👻😹",
"واحد بيشتكي لصاحبه بيقوله أنا مافيش حد بيحبني ولا يفتكرني أبدًا، ومش عارف أعمل إيه قاله سهلة استلف من الناس فلوس هيسألوا عليك كل يوم 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ؟ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه 👻😹",
"واحده ست سايقه على الجي بي اي قالها انحرفي قليلًا قلعت الطرحة 👻😹",
"مرة واحد غبي معاه عربية قديمة جدًا وبيحاول يبيعها وماحدش راضي يشتريها.. راح لصاحبه حكاله المشكلة صاحبه قاله عندي لك فكرة جهنمية هاتخليها تتباع الصبح أنت تجيب علامة مرسيدس وتحطها عليها. بعد أسبوعين صاحبه شافه صدفة قاله بعت العربية ولا لاء؟ قاله انت  مجنون حد يبيع مرسيدس 👻😹",
"مره واحد بلديتنا كان بيدق مسمار فى الحائط فالمسمار وقع منه فقال له :تعالى ف مجاش, فقال له: تعالي ف مجاش. فراح بلديتنا رامي على المسمار شوية مسمامير وقال: هاتوه 👻😹",
"واحدة عملت حساب وهمي ودخلت تكلم جوزها منه ومبسوطة أوي وبتضحك سألوها بتضحكي على إيه قالت لهم أول مرة يقول لي كلام حلو من ساعة ما اتجوزنا 👻😹",
"بنت حبت تشتغل مع رئيس عصابة شغلها في غسيل الأموال 👻😹",
"مره واحد اشترى فراخ علشان يربيها فى قفص صدره 👻😹",
"مرة واحد من الفيوم مات اهله صوصوا عليه 👻😹",
"ﻣﺮه واﺣﺪ ﻣﺴﻄﻮل ﻣﺎﺷﻰ ﻓﻰ اﻟﺸﺎرع ﻟﻘﻰ مذﻳﻌﻪ ﺑﺘﻘﻮﻟﻪ ﻟﻮ ﺳﻤﺤﺖ ﻓﻴﻦ اﻟﻘﻤﺮ ﻗﺎﻟﻬﺎ اﻫﻮه ﻗﺎﻟﺘﻠﻮ ﻣﺒﺮوك ﻛﺴﺒﺖ ﻋﺸﺮﻳﻦ ﺟﻨﻴﻪ ﻗﺎﻟﻬﺎ ﻓﻰ واﺣﺪ ﺗﺎﻧﻰ ﻫﻨﺎك اﻫﻮه 👻😹",
"مره واحد شاط كرة فى المقص اتخرمت. 👻😹",
"مرة واحد رايح لواحد صاحبهفا البواب وقفه بيقول له انت طالع لمين قاله طالع أسمر شوية لبابايا قاله يا أستاذ طالع لمين في العماره 👻😹",
" وهه عاوز تانيي 👻😹 "
        ]

@Client.on_message(filters.command(["نكته","❤️‍🔥نكته","نكت","• نكته •","ضحك"], ""), group=73837730)
async def nokt(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(tjgkgjhjxt)
    await message.reply(f"**[{a}]({soesh})**")

txjfjvkbkvt = [
" اتحداك تقول سر محدش يعرفو", 
" تحداك تطلع تغني ف الكول،🤡", 
" اتحداك تقفل الكول🤡🌟", 
" اتحداك تقول حاجه محدش يعرفها عن صاحب البار،🤡", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تتصل بمطعم وتقوله عايز بيبرونة😂♥🤡", 
" اتحداك تخرج من كل الجروبات ال عندك 😂♥️", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" اتحداك تحكي شويه عن شخصيتك 🤡🌟", 
" اتحداك تجيب اسكرين من سيرش جوجل بتاعك😂♥", 
" اتحداك تغير صورة البروفايل زي بتاعتي", 
" اتحداك تقولي امك اسمها اي 😹♥️", 
" اتحداك تقطع 10 جنيه دلوقتي😂♥", 
" اتحداك تقفل الكول🤡🌟", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تبعت اخر سكرين شوت عندك 😹♥", 
" اتحداك تقولي امك اسمها اي 😹♥️", 
" اتحداك تقول لحد دا امك اسمها اي", 
" اتحداك تقول اكتر اكله بتحبها🤡😹", 
" اتحداك تقول اسم البيست فريند❤️😹", 
" اعمل منشن لوحده وقولها هاتي رقمك 😂♥️", 
" اتحداك تمنشن لواحد كلاون 🤡", 
" اتحداك تدخل الكول وتقولهم بصوت عالي انا حامل 😂♥️", 
" اتحداك تجيب سكرين شوت ل شات اكتر حد بتضحك معاه 😂♥️", 
" اتحداك تقول لحد دا امك اسمها اي", 
" اتحداك تغني في ريكورد وتبعتو", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" لو راجل قولي انت مرتبط بكام وحده دلوقتي 😂♥️", 
" اتحداك تبعتلي صوره حبيبتك 😂♥️", 
" غنيلي اغنيه ل حمو بيكا 😂♥️", 
" اتحداك تمنشن لحد وتقوله انت حكاك❤️😹", 
" اتحداك تمنشن اطيب واحد هنا🤡??", 
" اتحداك تقول مين الي انت بتكراش عليها هنا ♥️😹", 
" اتحداك تقول اسم حبيبتك", 
" اتحداك تقول اخر رساله جاتلك من مين", 
" اتحداك تبعت رقمك 😂♥️", 
" اتحداك تقول اسم حبيبتك", 
" اتحداك تقفل الكول 😂♥️", 
" اتحداك تقوم تصلي دلوقتي ♥️", 
" اتحداك تمنشن لحد وتقوله انت حكاك❤️😹", 
" اتحداك تقول لحد امك رقاصه", 
" اتحداك تجيب سكرين شوت ل شات اكتر حد بتضحك معاه 😂♥️", 
" اتحداك تمنشن لواحده وتقولها تيجي نتجوز ❤️😹", 
" اتحداك تقول اخر مره اتضربت امتا🤡🤡", 
" اتحداك تجيب اسكرين من سيرش جوجل بتاعك😂♥", 
" اتحداك تقول اسم اغلي صاحب بتحبه❤️😹", 
" اتحداك تمنشن اكتر واحد شايفه م محترم😹🤡", 
" اتحداك تحذف تلي دلوقتي 😂♥️", 
" اتحداك تقول بحبك لخمس منشن😂😉", 
" اتحداك تقفل الكول 😂♥️", 
" اتحداك تغني لحسن شاكوش❤️😹", 
" اتحداك تقول رايك عن السوشيال ميديا 🤡", 
"ا تحداك تتكلم بلهجة مختلفة لمدة دقيق😂♥", 
" اتحداك تعمل منشن لحد وتقول نكته سخيفة😂♥", 
" اتحداك تصور نفسك دلوقتي وتبعتها", 
" اتحداك تقول لاي حد بحبك", 
" اتحداك تنزل واقع وتقابلني 😂❤️", 
" اتحداك تقطع الهاند بتاعتك دلوقتي😂♥", 
" اتحداك تقول اخر رساله جاتلك من مين", 
" اتحداك تفتح كام وتقول كبسو كبسو🤡😹", 
" اتحداك تقوم تصلي دلوقتي ♥️", 
" اتحداك تقول انا م راجل 😹🤡", 
" اتحداك تقول مواصفات فتاة احلامك😹🩶", 
" اتحداك تطلع الكول ترقص عقباوي 😂♥️", 
" اتحداك تمنشن لواحده وتقولها امك حماتي❤️😹", 
" اتحداك تقول للقيصر بحبك 😹♥", 
" اتحداك ترمي نفسك من البلكونة 😂♥", 
" اتحداك تقولي عندك كام اكس ف حياتك 😹♥️", 
" اتحداك تقول ع عاده بتحب تعملها❤️😹", 
" اتحداك تقطع الهاند بتاعتك دلوقتي😂♥", 
" اتحداك تمنشن لواحده وتقولها امك حماتي❤️😹", 
" اتحداك تبعت اسكرين لشات اكتر واحد بتكلمه❤️😹", 
" اتحداك تقول اسم بنت معرفتش تشقطها ♥️😹", 
" اتحداك تقول مين اخر حد بعتلك رساله", 
" اتحداك تمنشن اكتر واحد شايفه م محترم😹🤡", 
" صلي على النبي وتبسم ♥️✨", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تمنشن لحد وتقوله ارقلصي😂♥", 
" اتحداك تمنشن لحد وتقوله ارقلصي😂♥", 
" اتحداك تغني لحسن شاكوش❤️😹", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تقول اسم كراش الطفوله ♥️😹", 
" اتحداك تعمل منشن لحد وتقول نكته سخيفة😂♥", 
" اتحداك تبعت رقم امك😂♥", 
" اتحداك تقلد صوت حيوان😂♥", 
" اتحداك تعمل منشن لواحد وتقولو تعال نرتبط 😂♥️", 
" اتحداك تقول بتعمل اي ف اوقات فراغك🤡😹", 
" اتحداك تقول موقف حصلك ومش قادر تنساه ♥️😹", 
" اتحداك تحط البايو بحبك الى مغلبنى 10 دقايق ??", 
" اتحداك تسال صحبك رأيه ف شخصيتك وتصرفاتك🤡🌟",
        ]
@Client.on_message(filters.command(["تحدي","• احكام •","حكم","تحدى","• تحدي •","احكام"], ""), group=756363543)
async def caes253ar(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    a = random.choice(txjfjvkbkvt)
    await message.reply(f"**[{a}]({soesh})**")    
 #..........................................   الردود       ................................................................
rdood = {}

@Client.on_message(filters.command(["قفل الردود","تعطيل الردود","قفل سمسمي","تعطيل سمسمي"], "") & filters.private,group=187637398)
async def abra245g(client, message):
   bot_username = client.me.username
   OWNER_ID = await get_dev(bot_username)
   if message.from_user.id == OWNER_ID or message.from_user.username in caes:
    rdood.setdefault(bot_username, []).append(bot_username)
    await message.reply_text(f"• تم قفل الردود بواسطه ↤︎「 {message.from_user.mention}")
    
@Client.on_message(filters.command(["فتح الردود","تفعيل الردود","فتح سمسمي","تفعيل سمسمي"], "") & filters.private,group=545177)
async def abr54ag(client, message):
   bot_username = client.me.username
   OWNER_ID = await get_dev(bot_username)
   if message.from_user.id == OWNER_ID or message.from_user.username in caes:
    rdood[bot_username].remove(bot_username)
    await message.reply_text(f"• تم فتح الردود بواسطه ↤︎「 {message.from_user.mention}")
       
rdod = []

@Client.on_message(filters.command(["قفل الردود","تعطيل الردود","قفل سمسمي","تعطيل سمسمي"], "") & filters.group, group=76373243) 
async def iddloc25k(client, message):
    bot_username = client.me.username    
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    group_id = message.chat.id
    chek = await client.get_chat_member(message.chat.id, message.from_user.id)
    if chek.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] or message.from_user.id == OWNER_ID or message.from_user.username in caes:
       if message.chat.id in rdod:
         return await message.reply_text("تم معطل من قبل🔒")
       rdod.append(message.chat.id)
       return await message.reply_text("تم تعطيل الردود بنجاح ✅🔒")
    else:
       return await message.reply_text("لازم تكون ادمن يشخه علشان اسمع كلامك")

@Client.on_message(filters.command(["فتح الردود","تفعيل الردود","فتح سمسمي","تفعيل سمسمي"], "") & filters.group, group=7062833) 
async def iddopen(client, message):
    bot_username = client.me.username
    OWNER_ID = await get_dev(bot_username)
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    group_id = message.chat.id
    chek = await client.get_chat_member(message.chat.id, message.from_user.id)
    if chek.status in [ChatMemberStatus.OWNER, ChatMemberStatus.ADMINISTRATOR] or message.from_user.id == OWNER_ID or message.from_user.username in caes:
       if not message.chat.id in rdod:
         return await message.reply_text("الردود مفعل من قبل ✅")
       rdod.remove(message.chat.id)
       return await message.reply_text("تم فتح الردود بنجاح ✅🔓")
    else:
       return await message.reply_text(f"عزرا عزيزي{message.from_user.mention}\n هذا الامر لا يخصك✨♥")
names = {} 

@Client.on_message(filters.text, group=57355566)
async def d5548on(client, message):
    if message.from_user is None or message.from_user.is_bot:
        return
    bot_username = client.me.username
    soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
    me = names.get(bot_username) if names.get(bot_username) else f"{name}"
    hhs = client.me.username
    if hhs in rdood.get(hhs, []):
        return
    if message.chat.id in rdod:
        return  
    if any(keyword in message.text for keyword in ["عمري", "قلبي", "قلبى", "حياتي", "روحي", "بعشقك", "روحى", "حياتى", "عمرى", "قلبك", "قلبه", "بحبك", "بحبكم", "حبك", "حبيبكم", "حبيبي", "حبيبتي", "حبيبى", "حبيبتى", "عسل", "لف يو", "لفيو", "love","يقلبي"]):
         responses = ["وانت اكتر ياقلبى", "I love you", "وانا بعشقك بموت فيك", "ياروحي وانا اكتر احبك", "انا احبكم موت", "حبك اكتر ياروحي😍", "وانا بموت فيك🥰", "وانا كمان يقلبي😘", "عمري انت❤️", "عمري كلو ليك🫂", "انت عمري كلو🙈", "قلبي انت🩶", "انت قلبى🫂", "انت حبيب قلبي🖤", "قلبي من جوا❤️", "حياتي انت", "انت حياتي كلها", "حياتي انت", "طلعت روحك", "ونبي انت روحي", "روحي كلها انت", "انت العشق يبني", "انت العشق يقلبي", "أنا بعشقك اكتر", "انت العشق كده كده"]
         selected_response = random.choice(responses)
         await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["مح","بوسه","بوسة","محح","موح","قبله","قبلني","قبلتي","قبلنى","قبلتى","😘"]):
        responses = ["طب هات أنا كمان","لا انا زعلانه وانا وله عشان سيبك يعني","استغفرالله شواذ","بس عيب بتكسف","الحاجات دي مش هنا خليها ما بنا في البف","اي القرف دي اي بوسه دي","بحب المح بتاعتك😉"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["وحشتيني","وحشتوني","وحشني","وحشتونى","وحشنى","وحشتينى","وحشتني","وحشتنى","مفتقدك","افتقدتك","استفقدتك"]):
        responses = ["افتقدتك ي عمري ❤️‍🔥","اكتر ي عمري","وحشتني عيونك","مفتقدك جدا 🥺","انا ايضا افتقدك","وحشني روحك ♥","وحشتني متشفيش الوحش😂♥","وحشني اشتقتلك♥","وحشتني ليك وحشه ❤","وحش ميلهفك 😂😂","وحشني وربنا انت اكتر ❤","وحشني حبيب قلبي ❤","حبيب قلبي الي وحشني 🌚♥","وحشنا يوحش الكون ♥","وحشتني وحش اما يلهفك ❤","وحشتنا يعم❤","وحشنا ي غالي ♥","وحشني ي نبض قلبي 🌚","وحشتني ي عم فينك وفين لياليك💖","وحشني من زمان 💕","وحشتنا ي روحي ❣️","بحبك وحشتيني ♥","حبيبي وحشني ❤","وحشني ي نور عيني 👀"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["سيفى","عرفينا","سى فى","سي في","سيفى","عرفني","مين","سى في","سي فى"]):
        responses = ["ما تبط شقط بقا قرفتني 😂","مرتبطه جوزي قالي مش تقولي لحد","لا عوز تعرفني لي يعني 😎","مش برتبط فاهمك 😏","تدفع كام 😂❤️‍🔥","كفايه شقط سيب حاجه لغيرك 😂🌚","مريم 20 سنه من القاهره وانت عرفني عليك 🌚❤️‍🔥","اسمى: بنت ابويا،\n سني: عايشه من زمان\n سكنه ف بتنا وانت 😂🌚","انا قلبك ي قلبى ♥","هات بوسه وانا اقولك 😂"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["صباحو", "صباح","صبح","صبحو","صباحي","صباحى","'صباحك"]):
        responses = ["صباح الخير ي قلبي 😂♥","صباح ااخير علي التفاح ♥♥","صباح الورد والياسمين عليك يجميل 🤍🙃","صباح الخير ي عمري 🫂♥","صباح الخير ي روح قلبي 😂💖","صباح الورد علي الورد 🌺👀","صباح الياسمين علي عيون الجميل 👀😂","صباحك زي وشك 😂😁","صباحك منيل زيك ي منيل 😂🙃😁","اصتبحنا واصتبح الملك لله 😌🌚","اصتبحنا علي وشك يبقا يومنا من معدي 😁♥🌚","جتك نيله صباحك ابيض😁🤍","يسعدك صباحك ي خويا 😒😁😂🤍","صباحك ابيض يشق ♥🌚","صباحك عسل ي روحي ❤","صباح الورد عليك ي زميلي 🌺🌚❤","صباح الخيرات ي حبيب قلب اختك 🌚❤♥"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["مسا", "مساء","مسائو","تصبحو","تصباحو","ليله","ليلة","بليل","مسائى","مسائي","مساكم","مساهم","مساك","مسائها"]):
        responses = ["مسا مسا علي الناس الكويسه♥👀","مساء الخير ي قلبي ❤","مسا مسا عليك ي شق 🌚♥","مساك ابيض  ي زميلي 🤍👀","مساء الخير ي عمري 💖","يسعدك مساك ي خويا♥🌚","مساك مسا منيل 😁😌","كان نقصنا مساك واللهي 😂🙄","من غير مساك كنا نموت 🙄😒😂","مساء الفل 🌼","مساء النور علي لمبت حياتي 😂👀","مسا مسا علي الناس الي مش سالكه بربع جني 😂🌚🌚","مساك زي وشك👀♥♥","مساء الزفت علي دماغك 😂😁❤","مساء منيل بستين نيله 🙃♥","مساء مسا الرمان علي الرمان ❤🥂","مسا مسا علي الناس الي مش كويسه 😁😂😂♥"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)   
    elif any(keyword in message.text for keyword in ["سنك", "عمرك","سنه","عمركم","سنها","سنين","سنهم","عمر","عمرها","عمري"]):
        responses = ["عايشه من زمان اوي وانت😚","عندي 20 ياحب وانت 🩶","عندي 20 وانت ❤️","عارف بقالي سنين كتير اوي عايشه وانت☺️","قول انت كام الاول🙂","عندي 20 وانت برضو وله اكبر😇","عمري 20 ياعمري وانت😘","محدش بيسال السوال ده لي بت😒","أنا 20 وانت يا عمري😙","تعرف تعد لحد كام 😜","تعلا بف اقولك عندي كام🤭","بص يسطا السوال ده عيب لي اي بت","انت مالك😐","انت هتصحبني🥸","20 يامكنه وانت😉","20 يا قلب اختك وانت😍","20 يقلبي وانت😊","مش مهم مش دي الي هتحللك مشكلك😁","بص هو 20 وانا بقول 25 بس مشيها22👀😁","تعلا خاص وانا اقولك😉☺️"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)  
    elif any(keyword in message.text for keyword in ["منين","فينك","مكانك","مكان","وينك","من وين","من فين","مصر","القاهره","مدينه","مدينة","دوله","دولة","دولتي","مدينتي","مدينتى","دولتى"]):
        responses = ["من القاهره ي عمري وانت ❤🌚","من مصر ام الدنيا انت ♥👀","من قلب القاهره وانت 👤♥","منور القاهره واللهي🙂🤍","القاهره نورت بيك 😂♥","القاهره وانت 🙃💜","نورت القاهره ي شقي 🌚♥","انا القاهره انت😌❤","من القاهره يروحي وانت منين ❤","بلدي القاهره وانت 🙂♥","القاهره من غيرك ملهاش طعم انت منين بقا👀🌚♥","مصر منوره بيك وبيا 😌😂♥","من اجمد ناس القاهره انت بقا🙃♥","محافظه القاهره انت ❤","من مزز القاهره 😂♥انت","عايشه في شوارع مصر انت 😂🙃♥"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)       
    elif any(keyword in message.text for keyword in ["جيت","نورت","فينكم","هاي","هاى","اهلا","هلا","مرحبا","مرحب","مرحبآ","اهلاً","هلو","هايات"]):
        responses = ["نورت البيت ❤","منور 🌚","نورتنا ي غالي ♥","سمعني صوت عيارك💣","قوم فز افتح الباب 😂","يا مرحب بالغالي👀","اهلا وسهلا 🙂","تع تاني 🙃","ادخل واقفل الباب وراك😌","منورني والله 🤍","لو جبنا في سيره ربع جنيه مكنش جي ♥🌚😂","علي بالي جيت قولت اما اسال عليك ازيك 😂❤","سمعنا زغروطه بقا 😂🤍","شوف رايح فين بقا 🙄😂","كنت فين من بدري 🙃❤","اتصدق كنت علي بالي 😂💖","منورنا الوحش الي مبيرحمش 😂🌚","يادي النور يادي النور 😁❤"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["بخ", "عوو","رعب","خاف","اخاف","خوفت","رعبتني","رعبتنى","خضيتني","خفت","بخخ","عو"]):
        responses = ["يما خضيتني🔪😒","رعبتني يسطا🥸","خليت شعر ايدي يقف من الخضه😂","هو أنا المفرود كده اخاف واعيط😒","يخرابي رعبتني😂","بس لعب يا شاطر😁","يمامي خوفت 👍☺️","اعملها تاني واعمل نفسي هتخطيت😂","شغل الاطفال بقا هيقلي بخ وعو🙄","يمامي الحقيني خوفت🥸"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)       
    elif any(keyword in message.text for keyword in ["ريب", "نو ريب","توجيه","متبعتش","توجية"]):
        responses = ["هو أنا هعمل ريب علي الوزيره☺️","يبنتي انتي تطولي اصلا اعمل عليكي ريب😂","فوقي يا بت غيرك يتمنا مني الريب ده😂","انتي الي عامله ريب اصلا فوقي يقلبي😂","لا ونبي نفسي اعمل عليكي ريب يا بت😂","مش هعمل عليكي ريب يا ننسي عجرم😂","اهون مش اعمل عليكي ريب 😂😂","وغلاوت امي عملت فيا جميله😂","والنعمه أنا لو بكلم وزير الداخلية مش هيقولي كده😂"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)       
    elif any(keyword in message.text for keyword in ["ضحك","ضحكت","ههه","هههه","😂","🤣","😹","فصلت","فصلا","ضحكك","ضحكتي","ضحكتى","ضحكتك","😸","😁"]):
        responses = ["ضحك القمر 🌚","ضحكتك حلوه 😊","ضحكت يبقاا قلبها مال ☺️","ضحكتك عسل 😅😍","يخرابي ع الضحكه 😚","هو ده بجد 😳","أخيراً 😑","هي دي سنانك ولأ عقد لولي 😑😁","اقفلي بؤقك ليدخلك حاجه 😂","ساهله 😏","اتلمي 🔪","خفي ضحك 😒","بطلي توزعي ابتسامات علي الناس 🙂😡","هو إحنا هنا في كباريه ضحكتك واصله لآخر البار 🙂","عجبتني ضحكتك🌚♥","يدوم الضحك ي عمري❤👀","ضحكتك حلوه ي قلبي ♥","فصلا ضحك وربنا ❤😂","ضحكتك عسل ي روحي 🔥","احلي صوت سمعته صوت ضحكتك🫣♥","انا بصراحه فصلت ضحك مش قادره امسك نفسي من سعتها😂🌚♥","ضحك السنين بجد 😁??","فصلت فين الفيشه 🙃👀♥","يرب ضحكه عالطول 👀😂♥","اضحك بدل الهم الي الواحد في 😂❤","ايوا كدا فك مش تبوز ♥🌚","اضحك كدا متبقاش نكدي 💖😂","جتك نيله بتضحك علي خبتك 🙂♥","اضحك محدش واخد منها حاجه 🙃♥"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["بنات", "بنوته","بنوتة","بنت","بنوتي","بنوتى","بناتي","بناتى","بتت","بت"]):
        responses = ["بنت الاصول ي عمري ❤","بنت الاكابر ي قلبي ❤👏","بنات بس بميت راجل 😂😌","انا اجمل بنوته وربي 😂😌","احلي بنوته يخلاسي🙃♥","طول عمري بنت امي😂😁♥","بنات الجيه ي شق 🙃😂💖","البنات الطف الكائنات 😂💗","مفيش بنت احلي مني🤫💖♥","بنت الناس ي اتش🙄♥","انا بنوته مقطقطه ❤😂","بنت قلبي ي اخينه😂😌♥","وربي من غير البت دي الدنيا كانت اتقلبت😁♥","بنوته مسكره اوي 💗🌚","لقد وقعت في حب هذه البنات 🌚❤"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["توف", "تف","اتفو","تفه","تفة","تفاف","مقرف","معفن","القرف","عفن","زباله","زبالة","زفت","خرا","خره","معفنين"]):
        responses = ["تف علي وشك 😂","جتك الارف 😁👀","علي وشك ي حيوان 😂😁","جتك نيله عالم متختشيش😂🙃","يخرب بيت قرفك 😂💗","عالم مقرفه واللهي 😂","عليك ي معفن😂🌚💖","عيل مقرف جتك نيله 🙄😂","يععععع اي القرف دا 😒😁","في بوقك😁😂","علي شكلك يبعيد😂🙄","عليك ي جربان ي معفن😒♥😂","بعيد مش علينا غرقتنا جتك الارف😂😂😒","جتك الارف في شكلك😁❤🙄","عليك جتك نيله في شكلك الهباب😒♥😌😁"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)              
    elif any(keyword in message.text for keyword in ["اسكت","ويت","شششش","استني","استنى","اسكتي","اسكتى","اسكتو","سكته","شش","هوش"]):
        responses = ["محدش يسكتني اسكت براحتي","طب تمام تع واسكت معايه","غبي الملوك يتحدثون والغنم أمثالكم يسكتون.","لي كنت بتكلم من لسانك؟","شوف مين بيتكلم عن السكوت","طلعلك خس وبقيت تتكلم😏","ربي خلق لي لسان علشان أرد على أمثالك","حضرتك مش بتهش دبان","هشش دي لما نهش الكلاب الي زيك","ويت الله يرحم امك وابوك"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["بموت","متت","هموت","موت","موتي","موتى","موته","😵","⚰️","هموتت"]):
        responses = ["موت برا البار مش ناقصين مصيبه","يارب تموت ونخلص","امين","يسمع من بقك ربنا","يلا عشان نخلص","يارب تموت براحه","بعد الشر عليكي ياروحي","مع السلامه هنقرالك الفتحه"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["عياط","عياطي","عيط","دموع","😭","😥","😿","دموعى","دموعي","عيطي","عيطى","عياطى","دمعه","دمعتي","دمعتى","بكاء"]):
        responses = ["متعيطش 🥺","دموعك غاليه عليا 🥹","يلهوي القمر زعلان 😟","مين مات 🤨","مين ضربك 🧐","يلهوي عيون القمر بتعيط 😩","مين زعلك 🤨","اولع 😏","معاك للصبح 😒","متفرقش دموعك معايا 😒","في دموع تاني ولا خلاص خلصت 😒😟","امم أي كمان 😕","المفروض اعمل أي دلوقتي 😒","مليش في شغل المحن ده 🙂","تعيش وتعيط ي قمر 😅😁","أنت بدأت 😮‍💨🙄","اوووف بدأ القرف 🫨😬"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response)
    elif any(keyword in message.text for keyword in ["سلام","باى","باي","ماشي","ماشى","سلامات","بيباي","بيباى","🚶‍♀","🚶","🚶‍♂","🚶‍♀‍➡️","🚶‍➡️","🚶‍♂‍➡️","👩‍🦯","🧑‍🦯","👨‍🦯","👩‍🦯‍➡️","🧑‍🦯‍➡️","👨‍🦯‍➡️","🏃‍♀","🏃🏃‍♂","🏃‍♀‍➡️","🏃‍➡️","🏃‍♂‍➡️"]):
        responses = ["باي من غير سلام ❤😂","متسبنيش مقدرش من غيرك اعيش 😁❤","رايح فين 🌚🙃","خليك معانا♥","واللهي الدنيا وحشه من غيرك😂♥","متجيش تاني 😂","هتوحشنا يا غالي واللهي🙃♥","مشش في ركبك 😂🤍","غور في ستين داهيه 😁❤","ماشي ولا قاعد 👀😂","تمشي علي ضهرك 😁💖","يشلولك علي نقاله يبعيد 😂😌","هتمشي وتسبني 🙃❤","هتسبني طب لي 🥺❤","سلاموز بالموز حبايبي اللوز💜🌺","خد يلا هنا رايح فين 😂♥🌚"]     
        selected_response = random.choice(responses)
        await message.reply_text(selected_response) 
    elif any(keyword in message.text for keyword in ["بكرهك","مخصمك","خاصم","خصام","بكرهو","كرهك","كرهتك","مخصمكم","مبحبكش","مش بحبك","احبكش","قطوعه"]):
        responses = ["محدش طلب حبك في ناس احسن بتحبني 😋😀","اكبر دليل علي حب ربنا ليا انك بتكرهني 🥹","من امتي الخدم بيحبو اسيادهم 🙃😌","وانا اكتر ي عيوني 😉🤣","معروف الشياطين بتكره الملائكة 😌😚","حد قلك هموت من بعدك يعني 🤨😒","شايفني هموت عليك🙂‍↕️😏","نفس الاحساس🤩🤓","ومين قال اني بحبك🤗","انت بالزات لو حبتني هزعل😳🫨","مش محتاج لحبك 🥴🥱","حبك ميشرفنيش 😪","معلش معنديش وقت ابكي عليك 🤠","ميهمنيش حبك😮‍💨","كلما زاد عدد الكارهين قل عدد المنافقين من حياتي 🙄😬","وانا اكتر 😊","اخر همي انك تحبني اثلا🤓","كل واحد بيكره إللي كاسر عينك 😏🙄","فكرني هموت من بعدك ي محور الكون 🙀😼👩‍🎓","مش فارق معايا ☺️","علي الأقل مشتركين في نفس الشعور😏"]
        selected_response = random.choice(responses)
        await message.reply_text(selected_response) 
 #..........................................   الردود       ................................................................
 #..........................................   الردود   الثبته    ................................................................
@Client.on_message(filters.text & filters.group, group=54785566)
async def rady648on(client, message):
   bot_username = client.me.username
   soesh = devchannel.get(bot_username) if devchannel.get(bot_username) else f"{source}"
   if message.text in ["العاب","لعبه","لعبة","الالعاب"]:
       await message.reply_text(f" الالعاب 🕹: \n\n• لعبه `البنك`← لعرض اوامر لعبه البنك ارسل `البنك`\n\n• لعبه `اكس او` ←لبدا اللعبه ارسل `اكس او`\n\n• لعبه `حجرة` `ورقة` `مقص` ← لبدا العبه ارسل `حجرة` او `ورقه` او `مقص`\n\nلعبه `الجاسوس` ← لبدا العبه ارسل `الجاسوس`\n\nالغاز 🤔: \n← `ممثلين` ،  `مغنين` ،  `لاعبين` ،  `مشاهير` ،  `اعلام` ،  `افلام`\n← `مختلف` ،  `لغز`")
   elif message.text in ["الاجبار","الاشتراك الاجبار","الاشتراك"]:
       await message.reply_text(f"• الاشتراك الاجبار ✋← لا يمكن لاى شخص ان يكتب اى رساله دون ان يشترك ف القناه او الجروب المضافه ف الاشتراك الاجبار \n\n• ل `تفعيل الاشتراك `←يجب رفع البوت مشرف ف القناه او الجروب المطوب وضعه ف الاشتراك \n\n←ثم ارسال `تفعيل الاشتراك ` + رابط القناه او الجروب \n\n←مثلا: \n`تفعيل الاشتراك` {soesh}\n\n• لحذف قناه او جروب من الاشتراك\n\n←ارسل `تعطيل الاشتراك ` + رابط القناه او الجروب \n\n← مثلا: \n`تعطيل الاشتراك` {soesh}\n\nلعرض الاشتركات المضافه \n←ارسل `قنوات الاشتراك`")
   elif message.text in ["الرفع للترفيه","الرفع"]:
       await message.reply_text(f"الرفع: \n←`رفع اخ` ، `رفع اخت` ، `رفع بنتي` ، `رفع مراتي` ، `رفع زوجي` ، `رفع جدع` ، `رفع ابني` ، `رفع غبي` ، `رفع اهبل` \n← `رفع نمله`  ، `رفع صرصار` ، `رفع قرد` ، `رفع حمار` ، `رفع خنزير` ، `رفع عجل` ، `رفع كلب` ، `رفع خروف` ، `رفع جاموسه`\n← `رفع خول` ، `رفع متناك` ، `رفع عرص` ، `رفع نجس` ، `رفع ديوث` ،  `رفع شاذ`")       
   elif message.text in ["التنزيل للترفيه","التنزيل"]:
       await message.reply_text(f"التنزيل: \n←`تنزيل اخ` ، `تنزيل اخت` ، `تنزيل بنتي` ، `تنزيل مراتي` ، `تنزيل زوجي` ، `تنزيل جدع` ، `تنزيل ابني` ، `تنزيل غبي` ، `تنزيل اهبل` \n← `تنزيل نمله`  ، `تنزيل صرصار` ، `تنزيل قرد` ، `تنزيل حمار` ، `تنزيل خنزير` ، `تنزيل عجل` ، `تنزيل كلب` ، `تنزيل خروف` ، `تنزيل جاموسه` \n← `تنزيل خول` ، `تنزيل متناك` ، `تنزيل عرص` ، `تنزيل نجس` ، `تنزيل ديوث` ،  `تنزيل شاذ`")       
   elif message.text in ["مرفوعين","المرفوعين","لمرفوعين"]:
       await message.reply_text(f"المرفوعين: \n←`اخواتي` ، `اخوتي` ، `بناتي` ، `مراتاتي` ، `ازواجي` ، `ابنائي` ، `اغبياء` ، `الهبل` \n← `النمل` ، `الصارصير` ، `القرود` ، `الحمير` ، `الخنازير` ، `العجول` ، `الكلاب` ، `الخرفان` ، `الجواميس` \n← `الخولات` ، `المتناكين` ، `المعرصين` ، `النجسين` ، `الديوثين` ، `الشاذين`")       
   elif message.text in ["رمز","رموز","الرموز","الرمز"]:
       await message.reply_text("""
•𓃠 .𓅿 . 𓃠 . 𓃒 . 𓅰 . 𓃱∱ ∲ ∳ ∴ ∵ ∶ ∷ ∸ ∹ ∺ ∻ ∼ ∽ ∾ ∿ ≀ ≁ ≂ ≃ ≄ ≅ ≆ ≇ ≈ ≉ ≊ ≋ ≌ ≍ ≎ ≏ ≐ ≑ ≒ ≓ ≔ ≕ ≖ ≗ ≘ ≙ ≚ ≛ ≜ ≝ ≞ ≟ ≠ ≡ ≢ ≣ ≤ ≥ ≦ ≧ ≨ ≩ ≪ ≫ ≬ ≭ ≮ ≯ ≰ ≱ ≲ ≳ ≴ ≵ ≶ ≷ ≸ ≹ ≺ ≻ ≼ ≽ ≾ ≿ ⊀ ⊁ ⊂ ⊃ ⊄ ⊅ ⊆ ⊇ ⊈ ⊉ ⊊ ⊋ ⊌ ⊍ ⊎ ⊏ ⊐ ⊑ ⊒ ⊓ ⊔ ⊕ ⊖ ⊗ ⊘ ⊙ ⊚ ⊛ ⊜ ⊝ ⊞ ⊟ ⊠ ⊡ ⊢ ⊣ ⊤ ⊥ ⊦ ⊧ ⊨ ⊩ ⊪ ⊫ ⊬ ⊭ ⊮ ⊯ ⊰ ⊱ ⊲ ⊳ ⊴ ⊵ ⊶ ⊷ ⊸ ⊹ ⊺ ⊻ ⊼ ⊽ ⊾ ⊿   ⎔ ⎕ ⎖ ⎗ ⎘ ⎙ ⎚ ⎛ ⎜ ⎝ ⎞  ⏞ ⏟ ⏠ ⏡ ⏢ ⏣ ⏤ ⏥ ⏦ ␋ ␢ ▫️ ▬ ▭ ▮ ▯ ▰ ▱ ▲ △ ▴ ▵ ▷ ▸ ▹ ► ▻ ▼ ▽ ▾ ▿  ◁ ◂ ◃ ◄ ◅ ◆ ◇ ◈ ◉ ◊ ○ ◌ ◍ ◎ ● ◐ ◑ ◒ ◓ ◔ ◔ʊ ◕  ◬ ◭ ◮ ◯ ◰ ◱ ◲ ◳ ◴ ◵ ◶ ◷ ◸ ◹ ◺  ☓☠️ ☡☰ ☱ ☲ ☳ ☴ ☵ ☶ ☷ ♔ ♕ ♖ ♗ ♘ ♙ ♚ ♛ ♜ ♝ ♞ ♟ ♠️ ♡ ♢  ♩ ♪ ♫ ♬ ♭ ♮ ♯ ♰ ♱ ♻️ ♼ ♽ ⚆ ⚇ ⚈ ⚉ ⚊ ⚋ ⚌ ⚍ ⚎ ⚏ ⚐ ⚑ ✐ ✑ ✒️ ✓ ✔️ ✕ ✖️ ✗ ✘ ✙ ✚ ✛ ✜  ✞ ✟ ✠ ✢ ✣ ✤ ✥ ✦ ✧ ✧♱ ✩ ✪ ✫ ✬ ✭ ✮ ✯ ✰
 ✱ ✲  ✵ ✶ ✷ ✸ ✹ ✺  ❍ ❏ ❐ ❑ ❒ ❖  ❘ ❙ ❚ ❛ ❜ ❝ ❞ ❡ ❢  ❥ ❦ ❧ ❨ ❩ ❪ ❫ ❬ ❭ ❮ ❯ ❰ ❱ ❲ ❳ ❴ ❵ ➔ ➘  ➾ ⟀ ⟁ ⟂ ⟃ ⟄ ⟇ ⟈ ⟉ ⟊ ⟐ ⟑ ⟒ ⟓ ⟔ ⟕ ⟖ ⟗ ⟘ ⟙ ⟚ ⟛ ⟜ ⟝ ⟞ ⟟ ⟠ ⟡ ⟢ ⟣ ⟤ ⟥ ⟦ ⟧ ⟨ ⟩ ⟪ ⟫ ⟰ ⟱ ⟲ ⟳ ⟴ ⟵ ⟶ ⟷ ⟸ ⟹ ⟺ ⟻ ⟼ ⟽ ⟾ ⟿ ⤀ ⤦ ⤧ ⤨ ⤩ ⤪ ⤫ ⤬ ⤭ ⤮ ⤯ ⤰ ⤱ ⤲ ⤳ ⤶ ⤷ ⤸ ⤹ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⥂ ⥃ ⥄ ⥅ ⥆ ⥇ ⥈ ⥉ ⥊ ⥋ ⥌ ⥍ ⥎ ⥏ ⥐ ⥑ ⥒ ⥓ ⥔ ⥕ ⥖ ⥗ ⥘ ⥙ ⥚ ⥛ ⥜ ⥝ ⥞ ⥟ ⥠ ⥡ ⥢ ⥣ ⥤ ⥥ ⥦ ⥧ ⥨ ⥩ ⥪ ⥫ ⥬ ⥭ ⥮ ⥯ ⥰ ⥱ ⥲ ⥳ ⥴ ⥵ ⥶ ⥷ ⥸ ⥹ ⥺ ⥻ ⥼ ⥽ ⥾ ⥿ ⦀ ⦁ ⦂ ⦃ ⦄ ⦅ ⦆ ⦇ ⦈ ⦉ ⦊ ⦋ ⦌ ⦍ ⦎ ⦏ ⦐ ⦑ ⦒ ⦓ ⦔ ⦕ ⦖ ⦗ ⦘ ⦙ ⦚ ⦛ ⦜ ⦝ ⦞ ⦟ ⦠ ⦡ ⦢ ⦣ ⦤ ⦥ ⦦ ⦧ ⦨ ⦩ ⦪ ⦫ ⦬ ⦭ ⦮ ⦯ ⦰ ⦱ ⦲ ⦳ ⦴ ⦵ ⦶ ⦷ ⦸ ⦹ ⦺ ⦻ ⦼ ⦽ ⦾ ⦿ ⧀ ⧁ ⧂ ⧃ ⧄ ⧅ ⧆ ⧇ ⧈ ⧉ ⧊ ⧋ ⧌ ⧍ ⧎ ⧏ ⧐ ⧑ ⧒ ⧓ ⧔ ⧕ ⧖ ⧗ ⧘ ⧙ ⧚ ⧛ ⧜ ⧝ ⧞ ⧟ ⧡ ⧢ ⧣ ⧤ ⧥ ⧦ ⧧ ⧨ ⧩ ⧪ ⧫ ⧬ ⧭ ⧮ ⧯ ⧰ ⧱ ⧲ ⧳ ⧴ ⧵ ⧶ ⧷ ⧸ ⧹ ⧺ɷ""")
       await message.reply_text("""ᾋ ᾌ ᾍ ᾎ ᾏ ᾐ ᾑ ᾒ ᾓ ᾔ ᾕ ᾖ ᾗ ᾘ ᾙ ᾚ ᾛ ᾜ ᾝ ᾞ ᾟ ᾠ ᾡ ᾢ ᾣ ᾤ ᾥ ᾦ ᾧ ᾨ ᾩ ᾪ ᾫ ᾬ ᾭ ᾮ ᾯ ᾰ ᾱ ᾲ ᾳ ᾴ ᾶ ᾷ Ᾰ Ᾱ Ὰ Ά ᾼ ᾽ ι ᾿ ῀ ῁ ῂ ῃ ῄ ῆ ῇ Ὲ Έ Ὴ Ή ῌ ῍ ῎ ῏ ῐ ῑ ῒ ΐ ῖ ῗ Ῐ Ῑ Ὶ Ί ῝ ῞ ῟ ῠ ῡ ῢ ΰ ῤ ῥ ῦ ῧ Ῠ Ῡ Ὺ Ύ Ῥ ῭ ΅ ` ῲ ῳ ῴ ῶ ῷ Ὸ Ό Ὼ Ώ ῼ ´ ῾ ῿ ‐ ‑ ‒ – — ― ‖ ‗ ‘ ’ ‚ ‛ “ ” „ ‟ † ‡ • ‣ ․ ‥ … ‧       ‰ ‱ ′ ″ ‴ ‵ ‶ ‷ ‸ ‹ › ※ ‼️ ‽ ‾ ‿ ⁀ ⁁ ⁂ ⁃ ⁄ ⁅ ⁆ ⁇ ⁈ ⁉️ ⁊ ⁋ ⁌ ⁍ ⁎ ⁏ ⁐ ⁑ ⁒ ⁓ ⁔ ⁕ ⁖ ⁗ ⁘ ⁙ ⁚ ⁛ ⁜ ⁝ ⁞ ⁮ ⁯ ⁰ ⁱ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁿ ₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₐ ₑ ₒ ₓ ₕ ₖ ₗ ₘ ₙ ₚ ₛ ₜ ₝ ₞ ₟ ₠ ₡ ₢ ₣ ₤ ₥ ₦ ₧ ₨ ₩ ₪ ₫ € ₭ ₮ ₯ ₰ ₱ ₲ ₳ ₴ ₵ ℀ ℁ ℂ ℃ ℄ ℅ ℆ ℇ ℈ ℉ ℊ ℋ ℌ ℍ ℎ ℏ ℐ ℑ ℒ ℓ ℔ ℕ № ℗ ℘ ℙ ℚ ℛ ℜ ℝ ℞ ℟ ℠ ℡ ™ ℣ ℤ ℥ Ω ℧ ℨ ℩ K Å ℬ ℭ ℮ ℯ ℰ ℱ Ⅎ ℳ ℴ ℵ ℶ ℷ ℸ ℹ️ ℺ ℻ ℼ ℽ ℾ ℿ ⅀ ⅁ ⅂ ⅃ ⅄ ⅅ ⅆ ⅇ ⅈ ⅉ ⅊ ⅋ ⅌ ⅍ ⅎ ⅏ ⅐ ⅑ ⅒ ⅓ ⅔ ⅕ ⅖ ⅗ ⅘ ⅙ ⅚ ⅛ ⅜ ⅝ ⅞ ↀ ↁ ↂ Ↄ ↉ ↊ ↋ ← ↑ → ↓ ↔️ ↕️ ↖️ ↗️ ↘️ ↙️ ↚ ↛ ↜ ↝ ↞ ↟ ↠ ↡ ↢ ↣ ↤ ↥ ↦ ↧ ↨ ↩️ ↪️ ↫ ↬ ↭ ↮ ↯ ↰ ↱ ↲ ↳ ↴ ↵ ↶ ↷ ↸ ↹ ↺ ↻ ↼ ↽ ↾ ↿ ⇀ ⇁ ⇂ ⇃ ⇄ ⇅ ⇆ ⇇ ⇈ ⇉ ⇊ ⇋ ⇌ ⇍ ⇎ ⇏ ⇐ ⇑ ⇒ ⇓ ⇔ ⇕ ⇖ ⇗ ⇘ ⇙ ⇚ ⇛ ⇜ ⇝ ⇞ ⇟ ⇠ ⇡ ⇢ ⇣ ⇤ ⇥ ⇦ ⇧ ⇨ ⇩ ⇪ ⇫ ⇬ ⇭ ⇮ ⇯ ⇰ ⇱ ⇲ ⇳ ⇴ ⇵ ⇶ ⇷ ⇸ ⇹ ⇺ ⇻ ⇼ ⇽ ⇾ ⇿ ∀ ∁ ∂ ∃ ∄ ∅ ∆ ∇ ∈ ∉ ∊ ∋ ∌ ∍ ∎ ∏ ∐ ∑ − ∓ ∔ ∕ ∖ ∗ ∘ ∙ √ ∛ ∜ ∝ ∞ ∟ ∠ ∡ ∢ ∣ ∤ ∥ ∦ ∧ ∨ ∩ ∪ ∫ ∬ ∭ ∮ ∯ ∰ ∱ ∲ ∳ ∴ ∵ ∶ ∷ ∸ ∹ ∺ ∻ ∼ ∽ ∾ ∿ ≀ ≁ ≂ ≃ ≄ ≅ ≆ ≇ ≈ ≉ ≊ ≋ ≌ ≍ ≎ ≏ ≐ ≑ ≒ ≓ ≔ ≕ ≖ ≗ ≘ ≙ ≚ ≛ ≜ ≝ ≞ ≟ ≠ ≡ ≢ ≣ ≤ ≥ ≦ ≧ ≨ ≩ ≪ ≫ ≬ ≭ ≮ ≯ ≰ ≱ ≲ ≳ ≴ ≵ ≶ ≷ ≸ ≹ ≺ ≻ ≼ ≽ ≾ ≿ ⊀ ⊁ ⊂ ⊃ ⊄ ⊅ ⊆ ⊇ ⊈ ⊉ ⊊ ⊋ ⊌ ⊍ ⊎ ⊏ ⊐ ⊑ ⊒ ⊓ ⊔ ⊕ ⊖ ⊗ ⊘ ⊙ ⊚ ⊛ ⊜ ⊝ ⊞ ⊟ ⊠ ⊡ ⊢ ⊣ ⊤ ⊥ ⊦ ⊧ ⊨ ⊩ ⊪ ⊫ ⊬ ⊭ ⊮ ⊯ ⊰ ⊱ ⊲ ⊳ ⊴ ⊵ ⊶ ⊷ ⊸ ⊹ ⊺ ⊻ ⊼ ⊽ ⊾ ⊿ ⋀ ⋁ ⋂ ⋃ ⋄ ⋅ ⋆ ⋇ ⋈ ⋉ ⋊ ⋋ ⋌ ⋍ ⋎ ⋏ ⋐ ⋑ ⋒ ⋓ ⋔ ⋕ ⋖ ⋗ ⋘ ⋙ ⋚ ⋛ ⋜ ⋝ ⋞ ⋟ ⋠ ⋡ ⋢ ⋣ ⋤ ⋥ ⋦ ⋧ ⋨ ⋩ ⋪ ⋫ ⋬ ⋭ ⋮ ⋯ ⋰ ⋱ ⋲ ⋳ ⋴ ⋵ ⋶ ⋷ ⋸ ⋹ ⋺ ⋻ ⋼ ⋽ ⋾ ⋿ ⌀ ⌁ ⌂ ⌃ ⌄ ⌅ ⌆ ⌇ ⌈ ⌉ ⌊ ⌋ ⌌ ⌍ ⌎ ⌏ ⌐ ⌑ ⌒ ⌓ ⌔ ⌕ ⌖ ⌗ ⌘ ⌙ ⌚️ ⌛️ ⌜ ⌝ ⌞ ⌟ ⌠ ⌡ ⌢ ⌣ ⌤ ⌥ ⌦ ⌧ ⌨️ 〈 〉 ⌫ ⌬ ⌭ ⌮ ⌯ ⌰ ⌱ ⌲ ⌳ ⌴ ⌵ ⌶ ⌷ ⌸ ⌹ ⌺ ⌻ ⌼ ⌽ ⌾ ⌿ ⍀ ⍁ ⍂ ⍃ ⍄ ⍅ ⍆ ⍇ ⍈ ⍉ ⍊ ⍋ ⍌ ⍍ ⍎ ⍏ ⍐ ⍑ ⍒ ⍓ ⍔ ⍕ ⍖ ⍗ ⍘ ⍙ ⍚ ⍛ ⍜ ⍝ ⍞ ⍟ ⍠ ⍡ ⍢ ⍣ ⍤ ⍥ ⍦ ⍧ ⍨ ⍩ ⍪ ⍫ ⍬ ⍭ ⍮ ⍯ ⍰ ⍱ ⍲ ⍳ ⍴ ⍵ ⍶ ⍷ ⍸ ⍹ ⍺ ⍻ ⍼ ⍽ ⍾ ⍿ ⎀ ⎁ ⎂ ⎃ ⎄ ⎅ ⎆ ⎇ ⎈ ⎉ ⎊ ⎋ ⎌ ⎍ ⎎ ⎏ ⎐ ⎑ ⎒ ⎓ ⎔ ⎕ ⎖ ⎗ ⎘ ⎙ ⎚ ⎛ ⎜ ⎝ ⎞ ⎟ ⎠ ⎡ ⎢ ⎣ ⎤ ⎥ ⎦ ⎧ ⎨ ⎩ ⎪ ⎫ ⎬ ⎭ ⎮ ⎯ ⎰ ⎱ ⎲ ⎳ ⎴ ⎵ ⎶ ⎷ ⎸ ⎹ ⎺ ⎻ ⎼ ⎽ ⎾ ⎿ ⏀ ⏁ ⏂ ⏃ ⏄ ⏅ ⏆ ⏇ ⏈ ⏉ ⏋ ⏌ ⏍ ⏎ ⏏️ ⏐ ⏑ ⏒ ⏓ ⏔ ⏕ ⏖ ⏗ ⏘ ⏙ ⏚ ⏛ ⏜ ⏝ ⏞ ⏟ ⏠ ⏡ ⏢ ⏣ ⏤ ⏥ ⏦ ␋ ␢ ␣ 
① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳ ⑴ ⑵ ⑶ ⑷ ⑸ ⑹ ⑺ ⑻ ⑼ ⑽ ⑾ ⑿ ⒀ ⒁ ⒂ ⒃ ⒄ ⒅ ⒆ ⒇ ⒈ ⒉ ⒊ ⒋ ⒌ ⒍ ⒎ ⒏ ⒐ ⒑ ⒒ ⒓ ⒔ ⒕ ⒖ ⒗ ⒘ ⒙ ⒚ ⒛ ⒜ ⒝ ⒞ ⒟ ⒠ ⒡ ⒢ ⒣ ⒤ ⒥ ⒦ ⒧ ⒨ ⒩ ⒪ ⒫ ⒬ ⒭ ⒮ ⒯ ⒰ ⒱ ⒲ ⒳ ⒴ ⒵ Ⓐ Ⓑ Ⓒ Ⓓ Ⓔ Ⓕ Ⓖ Ⓗ Ⓘ Ⓙ Ⓚ Ⓛ Ⓜ️ Ⓝ Ⓞ Ⓟ Ⓠ Ⓡ Ⓢ Ⓣ Ⓤ Ⓥ Ⓦ Ⓧ Ⓨ Ⓩ ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ ⓪ ⓫ ⓬ ⓭ ⓮ ⓯ ⓰ ⓱ ⓲ ⓳ ⓴ ⓵ ⓶ ⓷ ⓸ ⓹ ⓺ ⓻ ⓼ ⓽ ⓾ ⓿ ─ ━ │ ┃ ┄ ┅ ┆ ┇ ┈ ┉ ┊ ┋ ┌ ┍ ┎ ┏ ┐ ┑ ┒ ┓ └ ┕ ┖ ┗ ┘ ┙ ┚ ┛ ├ ┝ ┞ ┟ ┠ ┡ ┢ ┣ ┤ ┥ ┦ ┧ ┨ ┩ ┪ ┫ ┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻ ┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╌ ╍ ╎ ╏ ═ ║ ╒ ╓ ╔ ╕ ╖ ╗ ╘ ╙ ╚ ╛ ╜ ╝ ╞ ╟ ╠ ╡ ╢ ╣ ╤ ╥ ╦ ╧ ╨ ╩ ╪ ╫ ╬ ╬﹌ ╭ ╮ ╯ ╰ ╰☆╮ ╱ ╲ ╳ ╴ ╵ ╶ ╷ ╸ ╹ ╺ ╻ ╼ ╽ ╾ ╿ ▀ ▁ ▂ ▃ ▄ ▅ ▆ ▇ █ ▉ ▊ ▋ ▌ ▍ ▎ ▏ ▐ ░ ▒ ▓ ▔ ▕ ▖ ▗ ▘ ▙ ▚ ▛ ▜ ▝ ▞ ▟ ■ □ ▢ ▣ ▤ ▥ ▦ ▧ ▨ ▩ ▪️ ▫️ ▬ ▭ ▮ ▯ ▰ ▱ ▲ △ ▴ ▵ ▷ ▸ ▹ ► ▻ ▼ ▽ ▾ ▿  ◁ ◂ ◃ ◄ ◅ ◆ ◇ ◈ ◉ ◊ ○ ◌ ◍ ◎ ● ◐ ◑ ◒ ◓ ◔ ◔ʊ ◕ ◖ ◗ ◘ ◙ ◚ ◛ ◜ ◝ ◞ ◟ ◠ ◡ ◢ ◣ ◤ ◥ ◦ ◧ ◨ ◩ ◪ ◫ ◬ ◭ ◮ ◯ ◰ ◱ ◲ ◳ ◴ ◵ ◶ ◷ ◸ ◹ ◺  ☓☠️ ☡☰ ☱ ☲ ☳ ☴ ☵ ☶ ☷ ♔ ♕ ♖ ♗ ♘ ♙ ♚ ♛ ♜ ♝ ♞ ♟ ♠️ ♡ ♢  ♩ ♪ ♫ ♬ ♭ ♮ ♯ ♰ ♱ ♻️ ♼ ♽ ⚆ ⚇ ⚈ ⚉ ⚊ ⚋ ⚌ ⚍ ⚎ ⚏ ⚐ ⚑ ✐ ✑ ✒️ ✓ ✔️ ✕ ✖️ ✗ ✘ ✙ ✚ ✛ ✜  ✞ ✟ ✠ ✢ ✣ ✤ ✥ ✦ ✧ ✧♱ ✩ ✪ ✫ ✬ ✭ ✮ ✯ ✰ ✱ ✲  ✵ ✶ ✷ ✸ ✹ ✺ ✻ ✼ ✽ ✾ ✿ ❀ ❁ ❂ ❃ ❄️ ❅ ❆ ❈ ❉ ❊ ❋ ❍ ❏ ❐ ❑ ❒ ❖ ❗️ ❘ ❙ ❚ ❛ ❜ ❝ ❞ ❡ ❢ ❣️ ❤️ ❥ ❦ ❧ ❨ ❩ ❪ ❫ ❬ ❭ ❮ ❯ ❰ ❱ ❲ ❳ ❴ ❵ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ➀ ➁ ➂ ➃ ➄ ➅ ➆ ➇ ➈ ➉ ➊ ➋ ➌ ➍ ➎ ➏ ➐➑ ➒ ➓ ➔ ➘ ➙ ➚ ➛ ➜ ➝ ➞ ➟ ➠  ➢ ➣ ➤ ➥ ➦ ➧ ➨ ➩ ➪ ➫ ➬ ➭ ➮ ➯ ➱ ➲ ➳ ➴ ➵ ➶ ➷ ➸ ➹ ➺ ➻ ➼ ➽ ➾ ⟀ ⟁ ⟂ ⟃ ⟄ ⟇ ⟈ ⟉ ⟊ ⟐ ⟑ ⟒ ⟓ ⟔ ⟕ ⟖ ⟗ ⟘ ⟙ ⟚ ⟛ ⟜ ⟝ ⟞ ⟟ ⟠ ⟡ ⟢ ⟣ ⟤ ⟥ ⟦ ⟧ ⟨ ⟩ ⟪ ⟫ ⟰ ⟱ ⟲ ⟳ ⟴ ⟵ ⟶ ⟷ ⟸ ⟹ ⟺ ⟻ ⟼ ⟽ ⟾ ⟿ ⤀ ⤁ ⤂ ⤃ ⤄ ⤅ ⤆ ⤇ ⤈ ⤉ ⤊ ⤋ ⤌ ⤍ ⤎ ⤏ ⤐ ⤑ ⤒ ⤓ ⤔ ⤕ ⤖ ⤗ ⤘ ⤙ ⤚ ⤛ ⤜ ⤝ ⤞ ⤟ ⤠ ⤡ ⤢ ⤣ ⤤ ⤥ ⤦ ⤧ ⤨ ⤩ ⤪ ⤫ ⤬ ⤭ ⤮ ⤯ ⤰ ⤱ ⤲ ⤳ ⤶ ⤷ ⤸ ⤹ ⤺ ⤻ ⤼ ⤽ ⤾ ⤿ ⥀ ⥁ ⥂ ⥃ ⥄ ⥅ ⥆ ⥇ ⥈ ⥉ ⥊ ⥋ ⥌ ⥍ ⥎ ⥏ ⥐ ⥑ ⥒ ⥓ ⥔ ⥕ ⥖ ⥗ ⥘ ⥙ ⥚ ⥛ ⥜ ⥝ ⥞ ⥟ ⥠ ⥡ ⥢ ⥣ ⥤ ⥥ ⥦ ⥧ ⥨ ⥩ ⥪ ⥫ ⥬ ⥭ ⥮ ⥯ ⥰ ⥱ ⥲ ⥳ ⥴ ⥵ ⥶ ⥷ ⥸ ⥹ ⥺ ⥻ ⥼ ⥽ ⥾ ⥿ ⦀ ⦁ ⦂ ⦃ ⦄ ⦅ ⦆ ⦇ ⦈ ⦉ ⦊ ⦋ ⦌ ⦍ ⦎ ⦏ ⦐ ⦑ ⦒ ⦓ ⦔ ⦕ ⦖ ⦗ ⦘ ⦙ ⦚
 ⦛ ⦜ ⦝ ⦞ ⦟ ⦠ ⦡ ⦢ ⦣ ⦤ ⦥ ⦦ ⦧ ⦨ ⦩ ⦪ ⦫ ⦬ ⦭ ⦮ ⦯ ⦰ ⦱ ⦲ ⦳ ⦴ ⦵ ⦶ ⦷ ⦸ ⦹ ⦺ ⦻ ⦼ ⦽ ⦾ ⦿ ⧀ ⧁ ⧂ ⧃ ⧄ ⧅ ⧆ ⧇ ⧈ ⧉ ⧊ ⧋ ⧌ ⧍ ⧎ ⧏ ⧐ ⧑ ⧒ ⧓ ⧔ ⧕ ⧖ ⧗ ⧘ ⧙ ⧚ ⧛ ⧜ ⧝ ⧞ ⧟ ⧡ ⧢ ⧣ ⧤ ⧥ ⧦ ⧧ ⧨ ⧩ ⧪ ⧫ ⧬ ⧭ ⧮ ⧯ ⧰ ⧱ ⧲ ⧳ ⧴ ⧵ ⧶ ⧷ ⧸ ⧹ ⧺ɷ""")
   elif message.text in ["تحميل","نزل","يوتيوب","حمل","تنزل","تنزيل"]:
       await message.reply_text(f"ادخل البوت واكتب `تحميل` او `تنزيل` @{bot_username}")        
#..........................................   الردود   الثبته    ................................................................
#..........................................   اخ       ................................................................
akhoia = {}

@Client.on_message(filters.command(["رفع اخ"], "") & filters.group, group=36)
async def rf3akhoia(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")

    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in akhoia:
        akhoia[user_id] = [] 
    akhoia[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه اخ🌚\n│ \n└ʙʏ : {reply_name}\n\nاخويه وحبيبي🫂")

@Client.on_message(filters.command(["تنزيل اخ"], "") & filters.group, group=37)
async def tnzel_akhoia(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")

    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in akhoia and reply_name in akhoia[user_id]:
        akhoia[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيله اخ\n│ \n└ʙʏ : {reply_name}\n\n طلع نقص 😒🙂")
    else:
        await message.reply_text("مش مرفوع اخ اصلا")    

@Client.on_message(filters.command(["اخواتي"], "") & filters.group, group=38)
async def akhoia_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in akhoia and akhoia[user_id]: 
        nq = "\n".join(akhoia[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد اخ اصلا")
#..........................................   اخ       ................................................................
#..........................................   جدع       ................................................................
algdan = {}

@Client.on_message(filters.command(["رفع جدع"], "") & filters.group, group=105)
async def rf3aalgdan(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in algdan:
        algdan[user_id] = [] 
    algdan[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع جدع🙈\n│ \n└ʙʏ : {reply_name}\n\nابن امي الي مفيش منو اتنين🙈❤️")

@Client.on_message(filters.command(["تنزيل جدع"], "") & filters.group, group=106)
async def tnzel_algdan(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in algdan and reply_name in algdan[user_id]:
        algdan[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل جدع😒\n│ \n└ʙʏ : {reply_name}\n\n انت وله ابن امي ولا اعرفك اتفو😒")
    else:
        await message.reply_text("مش مرفوع جدع اصلا")    

@Client.on_message(filters.command(["الجدعان"], "") & filters.group, group=107)
async def algdan_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in algdan and algdan[user_id]: 
        nq = "\n".join(algdan[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد جدع اصلا")
#..........................................   جدع       ................................................................
#..........................................   اخت       ................................................................
o1kh1ty = {}

@Client.on_message(filters.command(["رفع اخت"], "") & filters.group, group=39)
async def rf3o1kh1ty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in o1kh1ty:
        o1kh1ty[user_id] = [] 
    o1kh1ty[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه اخت☺️\n│ \n└ʙʏ : {reply_name}\n\n قلب اختك🫂❤️")

@Client.on_message(filters.command(["تنزيل اخت"], "") & filters.group, group=40)
async def tnzel_o1kh1ty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in o1kh1ty and reply_name in o1kh1ty[user_id]:
        o1kh1ty[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيله اخت😌\n│ \n└ʙʏ : {reply_name}\n\nاخص مكنش العشم فيك😒")
    else:
        await message.reply_text("مش مرفوع اخت اصلا")    

@Client.on_message(filters.command(["اخوتي"], "") & filters.group, group=41)
async def o1kh1ty_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in o1kh1ty and o1kh1ty[user_id]: 
        nq = "\n".join(o1kh1ty[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد اخت اصلا")
#..........................................   اخت       ................................................................
#..........................................   بنتي       ................................................................
ban1aty = {}

@Client.on_message(filters.command(["رفع بنتي"], "") & filters.group, group=42)
async def rf3ban1aty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id not in ban1aty:
        ban1aty[user_id] = [] 
    ban1aty[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه بنتي😊\n│ \n└ʙʏ : {reply_name}\n\n قلب يبنتك كده كده💋😌")

@Client.on_message(filters.command(["تنزيل بنتي"], "") & filters.group, group=43)
async def tnzel_ban1aty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in ban1aty and reply_name in ban1aty[user_id]:
        ban1aty[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيله بنتي😌\n│ \n└ʙʏ : {reply_name}\n\n بنتك من لحمك ودمك تبعها كده اخص😔🥺")
    else:
        await message.reply_text("مش مرفوع بنتي اصلا")    

@Client.on_message(filters.command(["بناتي"], "") & filters.group, group=44)
async def ban1aty_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in ban1aty and ban1aty[user_id]: 
        nq = "\n".join(ban1aty[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد بنتي اصلا")
#..........................................   بنتي       ................................................................
#..........................................   مراتي       ................................................................
mrataty = {}

@Client.on_message(filters.command(["رفع مراتي"], "") & filters.group, group=45)
async def rf3mrataty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in mrataty:
        mrataty[user_id] = [] 
    mrataty[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه زوجي😉\n│ \n└ʙʏ : {reply_name}\n\n حبيبي وقره عيني🫂😂")

@Client.on_message(filters.command(["تنزيل مراتي"], "") & filters.group, group=46)
async def tnzel_mrataty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in mrataty and reply_name in mrataty[user_id]:
        mrataty[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل مراتى😒\n│ \n└ʙʏ : {reply_name}\n\n طلعت طيزها حمره 😂🌚")
    else:
        await message.reply_text("مش مرفوع مراتي اصلا")    

@Client.on_message(filters.command(["مراتاتي"], "") & filters.group, group=47)
async def mrataty_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in mrataty and mrataty[user_id]: 
        nq = "\n".join(mrataty[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد مراتي اصلا")
#..........................................   مراتي       ................................................................
#..........................................   زوجي       ................................................................
zogaty = {}

@Client.on_message(filters.command(["رفع زوجي"], "") & filters.group, group=48)
async def rf3zogaty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in zogaty:
        zogaty[user_id] = [] 
    zogaty[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه زوجي😉\n│ \n└ʙʏ : {reply_name}\n\n حبيبي وقره عيني🫂😂")

@Client.on_message(filters.command(["تنزيل زوجي"], "") & filters.group, group=49)
async def tnzel_zogaty(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in zogaty and reply_name in zogaty[user_id]:
        zogaty[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل زوجي😒\n│ \n└ʙʏ : {reply_name}\n\n طلقتني ياخاين طب والي في بطني😂")
    else:
        await message.reply_text("مش مرفوع زوجي اصلا")    

@Client.on_message(filters.command(["ازواجي"], "") & filters.group, group=50)
async def zogaty_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in zogaty and zogaty[user_id]: 
        nq = "\n".join(zogaty[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد زوجي اصلا")
#..........................................   زوجي       ................................................................
#..........................................   ابني       ................................................................
ab1nay = {}

@Client.on_message(filters.command(["رفع ابني"], "") & filters.group, group=51)
async def rf3ab1nay(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in ab1nay:
        ab1nay[user_id] = [] 
    ab1nay[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع ابني☺️\n│ \n└ʙʏ : {reply_name}\n\n ابن وحبيبي وابن بطني😁")

@Client.on_message(filters.command(["تنزيل ابني"], "") & filters.group, group=52)
async def tnzel_ab1nay(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in ab1nay and reply_name in ab1nay[user_id]:
        ab1nay[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل ابني😔\n│ \n└ʙʏ : {reply_name}\n\n يابني ميتين الكلب اتبريت مني اخص💔")
    else:
        await message.reply_text("مش مرفوع ابني اصلا")    

@Client.on_message(filters.command(["ابنائي"], "") & filters.group, group=53)
async def ab1nay_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in ab1nay and ab1nay[user_id]: 
        nq = "\n".join(ab1nay[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد ابني اصلا")
#..........................................   ابني       ................................................................
#..........................................   غبي       ................................................................
agb1iaa = {}

@Client.on_message(filters.command(["رفع غبي"], "") & filters.group, group=54)
async def rf3agb1iaa(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in agb1iaa:
        agb1iaa[user_id] = [] 
    agb1iaa[user_id].append(reply_name)    
    await message.reply_text(f"تم رفعه غبي😁\n│ \n└ʙʏ : {reply_name}\n\n وارث الغباء منك نيها نيها😂")

@Client.on_message(filters.command(["تنزيل غبي"], "") & filters.group, group=55)
async def tnzel_agb1iaa(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in agb1iaa and reply_name in agb1iaa[user_id]:
        agb1iaa[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل غبي😁\n│ \n└ʙʏ : {reply_name}\n\nالحمدلله اكتشف اني مش غبي😂❤️")
    else:
        await message.reply_text("مش مرفوع غبي اصلا")    

@Client.on_message(filters.command(["اغبياء"], "") & filters.group, group=56)
async def agb1iaa_list(client, message):
    user_id = message.from_user.id 
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in agb1iaa and agb1iaa[user_id]: 
        nq = "\n".join(agb1iaa[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد غبي اصلا")
#..........................................   غبي       ................................................................
#..........................................   اهبل       ................................................................
alh1obl = {}

@Client.on_message(filters.command(["رفع اهبل"], "") & filters.group, group=57)
async def rf3alh1obl(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in alh1obl:
        alh1obl[user_id] = [] 
    alh1obl[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع اهبل😁\n│ \n└ʙʏ : {reply_name}\n\n رقم مستشفى المجنين بسرعه 😁")

@Client.on_message(filters.command(["تنزيل اهبل"], "") & filters.group, group=58)
async def tnzel_alh1obl(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in alh1obl and reply_name in alh1obl[user_id]:
        alh1obl[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيله اهبل😁\n│ \n└ʙʏ : {reply_name}\n\n اتعلجت الحمدلله💃😁")
    else:
        await message.reply_text("مش مرفوع اهبل اصلا")    

@Client.on_message(filters.command(["الهبل"], "") & filters.group, group=59)
async def alh1obl_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in alh1obl and alh1obl[user_id]: 
        nq = "\n".join(alh1obl[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد اهبل اصلا")
#..........................................   اهبل       ................................................................
#..........................................   نمله       ................................................................
nmla = {}

@Client.on_message(filters.command(["رفع نمله"], "") & filters.group, group=60)
async def rf3nmla(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in nmla:
        nmla[user_id] = [] 
    nmla[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع نمله😁\n│ \n└ʙʏ : {reply_name}\n\n شوفت نمله عامله عمله😂😂")

@Client.on_message(filters.command(["تنزيل نمله"], "") & filters.group, group=61)
async def tnzel_nmla(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in nmla and reply_name in nmla[user_id]:
        nmla[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل النمله\n│ \n└ʙʏ : {reply_name}\n\n الله يرحمه كانت عامله عمله😁")
    else:
        await message.reply_text("مش مرفوع نمله اصلا")    

@Client.on_message(filters.command(["النمل"], "") & filters.group, group=62)
async def nmla_list(client, message):
    user_id = message.from_user.id   
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in nmla and nmla[user_id]: 
        nq = "\n".join(nmla[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد نمله اصلا")
#..........................................   نمله       ................................................................
#..........................................   صرصار       ................................................................
sorsar = {}

@Client.on_message(filters.command(["رفع صرصار"], "") & filters.group, group=63)
async def rf3sorsar(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in sorsar:
        sorsar[user_id] = [] 
    sorsar[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع صرصار🪳\n│ \n└ʙʏ : {reply_name}\n\n هاتو شبشب بسرعه 😂 😁")

@Client.on_message(filters.command(["تنزيل صرصار"], "") & filters.group, group=64)
async def tnzel_sorsar(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in sorsar and reply_name in sorsar[user_id]:
        sorsar[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل صرصار\n│ \n└ʙʏ : {reply_name}\n\n مات كان طيب🪳🫣")
    else:
        await message.reply_text("مش مرفوع صرصار اصلا")    

@Client.on_message(filters.command(["الصارصير"], "") & filters.group, group=65)
async def sorsar_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in sorsar and sorsar[user_id]: 
        nq = "\n".join(sorsar[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد صرصار اصلا")
#..........................................   صرصار       ................................................................
#..........................................   قرد       ................................................................
mon1key = {}

@Client.on_message(filters.command(["رفع قرد"], "") & filters.group, group=66)
async def rf3mon1key(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in mon1key:
        mon1key[user_id] = [] 
    mon1key[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع قرد🌚\n│ \n└ʙʏ : {reply_name}\n\nابو طيز حمرا 🍑")

@Client.on_message(filters.command(["تنزيل قرد"], "") & filters.group, group=67)
async def tnzel_mon1key(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in mon1key and reply_name in mon1key[user_id]:
        mon1key[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل القرد🙈\n│ \n└ʙʏ : {reply_name}\n\n يخصاره طلعت مش حمرا😂")
    else:
        await message.reply_text("مش مرفوع قرد اصلا")    

@Client.on_message(filters.command(["القرود"], "") & filters.group, group=68)
async def mon1key_list(client, message):
    user_id = message.from_user.id    
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in mon1key and mon1key[user_id]: 
        nq = "\n".join(mon1key[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد قرد اصلا")
#..........................................   قرد       ................................................................
#..........................................   حمار       ................................................................
alhamer = {}

@Client.on_message(filters.command(["رفع حمار"], "") & filters.group, group=69)
async def rf3alhamer(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in alhamer:
        alhamer[user_id] = [] 
    alhamer[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع حمار\n│ \n└ʙʏ : {reply_name}\n\n هركبك تع😊")

@Client.on_message(filters.command(["تنزيل حمار"], "") & filters.group, group=70)
async def tnzel_alhamer(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in alhamer and reply_name in alhamer[user_id]:
        alhamer[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل حمار\n│ \n└ʙʏ : {reply_name}\n\n طلعت مش حلو في الركبه😉😂")
    else:
        await message.reply_text("مش مرفوع حمار اصلا")    

@Client.on_message(filters.command(["الحمير"], "") & filters.group, group=71)
async def alhamer_list(client, message):
    user_id = message.from_user.id   
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if user_id in alhamer and alhamer[user_id]: 
        nq = "\n".join(alhamer[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد حمار اصلا")
#..........................................   حمار       ................................................................
#..........................................   خنزير       ................................................................
pi2356g = {}

@Client.on_message(filters.command(["رفع خنزير"], "") & filters.group, group=72)
async def rf3pi2356g(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in pi2356g:
        pi2356g[user_id] = [] 
    pi2356g[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع العضو\n│ \n└ʙʏ : {reply_name}\n\n خنزير 😂♥️")

@Client.on_message(filters.command(["تنزيل خنزير"], "") & filters.group, group=73)
async def tnzel_pi2356g(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in pi2356g and reply_name in pi2356g[user_id]:
        pi2356g[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل العضو\n│ \n└ʙʏ : {reply_name}\n\n خنزير 😂♥️")
    else:
        await message.reply_text("مش مرفوع خنزير اصلا")    

@Client.on_message(filters.command(["الخنازير"], "") & filters.group, group=74)
async def pi2356g_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in pi2356g and pi2356g[user_id]: 
        nq = "\n".join(pi2356g[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد خنزير اصلا")
#..........................................   خنزير       ................................................................
#..........................................   عجل       ................................................................
hu368rry = {}

@Client.on_message(filters.command(["رفع عجل"], "") & filters.group, group=75)
async def rf3hu368rry(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in hu368rry:
        hu368rry[user_id] = [] 
    hu368rry[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع عجل\n│ \n└ʙʏ : {reply_name}\n\nحضرو السككين😂")

@Client.on_message(filters.command(["تنزيل عجل"], "") & filters.group, group=76)
async def tnzel_hu368rry(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in hu368rry and reply_name in hu368rry[user_id]:
        hu368rry[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل عجل\n│ \n└ʙʏ : {reply_name}\n\n هرب من السلاخانه🙈")
    else:
        await message.reply_text("مش مرفوع عجل اصلا")    

@Client.on_message(filters.command(["العجول"], "") & filters.group, group=77)
async def hu368rry_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in hu368rry and hu368rry[user_id]: 
        nq = "\n".join(hu368rry[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد عجل اصلا")
#..........................................   عجل       ................................................................
#..........................................   كلب       ................................................................
do467g = {}

@Client.on_message(filters.command(["رفع كلب"], "") & filters.group, group=78)
async def rf3do467g(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in do467g:
        do467g[user_id] = [] 
    do467g[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع كلب\n│ \n└ʙʏ : {reply_name}\n\n هوهو وانا اجبلك عضمه😂")

@Client.on_message(filters.command(["تنزيل كلب"], "") & filters.group, group=79)
async def tnzel_do467g(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in do467g and reply_name in do467g[user_id]:
        do467g[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل كلب\n│ \n└ʙʏ : {reply_name}\n\n طلع غدار عض الايد الى اكلته😂🌚")
    else:
        await message.reply_text("مش مرفوع كلب اصلا")    

@Client.on_message(filters.command(["الكلاب"], "") & filters.group, group=80)
async def do467g_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return  
    if user_id in do467g and do467g[user_id]: 
        nq = "\n".join(do467g[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد كلب اصلا")
#..........................................   كلب       ................................................................
#..........................................   خروف       ................................................................
she578ep = {}

@Client.on_message(filters.command(["رفع خروف"], "") & filters.group, group=81)
async def rf3she578ep(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in she578ep:
        she578ep[user_id] = [] 
    she578ep[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع خروف\n│ \n└ʙʏ : {reply_name}\n\nسيب النعجه يا خروف😂")

@Client.on_message(filters.command(["تنزيل خروف"], "") & filters.group, group=82)
async def tnzel_she578ep(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in she578ep and reply_name in she578ep[user_id]:
        she578ep[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل خروف😁\n│ \n└ʙʏ : {reply_name}\n\nالنعجه والخروف هربو😂🤦‍♀")
    else:
        await message.reply_text("مش مرفوع خروف اصلا")    

@Client.on_message(filters.command(["الخرفان"], "") & filters.group, group=83)
async def she578ep_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in she578ep and she578ep[user_id]: 
        nq = "\n".join(she578ep[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد خروف اصلا")
#..........................................   خروف       ................................................................
#..........................................   جاموسه        ................................................................
buf689falo = {}

@Client.on_message(filters.command(["رفع جاموسه"], "") & filters.group, group=84)
async def rf3buf689falo(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in buf689falo:
        buf689falo[user_id] = [] 
    buf689falo[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع العضو\n│ \n└ʙʏ : {reply_name}\n\n جاموسه  😂♥️")

@Client.on_message(filters.command(["تنزيل جاموسه"], "") & filters.group, group=85)
async def tnzel_buf689falo(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in buf689falo and reply_name in buf689falo[user_id]:
        buf689falo[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل العضو\n│ \n└ʙʏ : {reply_name}\n\n جاموسه  😂♥️")
    else:
        await message.reply_text("مش مرفوع جاموسه  اصلا")    

@Client.on_message(filters.command(["الجواميس"], "") & filters.group, group=86)
async def buf689falo_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in buf689falo and buf689falo[user_id]: 
        nq = "\n".join(buf689falo[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد جاموسه  اصلا")
#..........................................   جاموسه        ................................................................
#..........................................    خول        ................................................................
yuseaf = {}

@Client.on_message(filters.command(["رفع خول"], "") & filters.group, group=87)
async def rf3yuseaf(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in yuseaf:
        yuseaf[user_id] = [] 
    yuseaf[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع خول\n│ \n└ʙʏ : {reply_name}\n\nرفعت الخول وهنيكو😂😂❤️")

@Client.on_message(filters.command(["تنزيل خول"], "") & filters.group, group=88)
async def tnzel_yuseaf(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in yuseaf and reply_name in yuseaf[user_id]:
        yuseaf[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل خول\n│ \n└ʙʏ : {reply_name}\n\n ريحتو ونزلتو عشانك😂😂♥️")
    else:
        await message.reply_text("مش مرفوع  خول  اصلا")    

@Client.on_message(filters.command(["الخولات"], "") & filters.group, group=89)
async def yuseaf_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in yuseaf and yuseaf[user_id]: 
        nq = "\n".join(yuseaf[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  خول  اصلا")
#..........................................    خول        ................................................................
#..........................................    متناك        ................................................................
harfosh = {}

@Client.on_message(filters.command(["رفع متناك"], "") & filters.group, group=90)
async def rf3harfosh(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in harfosh:
        harfosh[user_id] = [] 
    harfosh[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع متناك\n│ \n└ʙʏ : {reply_name}\n\n رفعتو عشان انيكو😂😂❤️")

@Client.on_message(filters.command(["تنزيل متناك"], "") & filters.group, group=91)
async def tnzel_harfosh(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in harfosh and reply_name in harfosh[user_id]:
        harfosh[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل متناك\n│ \n└ʙʏ : {reply_name}\n\n نيكتو ونزلتو😂♥️")
    else:
        await message.reply_text("مش مرفوع  متناك  اصلا")    

@Client.on_message(filters.command(["المتناكين"], "") & filters.group, group=92)
async def harfosh_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return 
    if user_id in harfosh and harfosh[user_id]: 
        nq = "\n".join(harfosh[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  متناك  اصلا")
#..........................................    متناك        ................................................................
#..........................................    عرص        ................................................................
alhadedy = {}

@Client.on_message(filters.command(["رفع عرص"], "") & filters.group, group=93)
async def rf3alhadedy(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    reply_name = message.reply_to_message.from_user.mention
    
    if user_id not in alhadedy:
        alhadedy[user_id] = [] 
    alhadedy[user_id].append(reply_name)
    
    await message.reply_text(f"تم رفع عرص\n│ \n└ʙʏ : {reply_name}\n\n رفعتو عشان يعرصلي😂😂♥️")

@Client.on_message(filters.command(["تنزيل عرص"], "") & filters.group, group=94)
async def tnzel_alhadedy(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id in alhadedy and reply_name in alhadedy[user_id]:
        alhadedy[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل عرص\n│ \n└ʙʏ : {reply_name}\n\n علشان بص عليا من خرم الباب😂😂♥️")
    else:
        await message.reply_text("مش مرفوع  عرص  اصلا")    

@Client.on_message(filters.command(["المعرصين"], "") & filters.group, group=95)
async def alhadedy_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return   
    if user_id in alhadedy and alhadedy[user_id]: 
        nq = "\n".join(alhadedy[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  عرص  اصلا")
#..........................................    عرص        ................................................................
#..........................................    نجس        ................................................................
almutamard = {}

@Client.on_message(filters.command(["رفع نجس"], "") & filters.group, group=96)
async def rf3almutamard(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    reply_name = message.reply_to_message.from_user.mention   
    if user_id not in almutamard:
        almutamard[user_id] = [] 
    almutamard[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع العضو\n│ \n└ʙʏ : {reply_name}\n\n  نجس  😂♥️")

@Client.on_message(filters.command(["تنزيل نجس"], "") & filters.group, group=97)
async def tnzel_almutamard(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    reply_name = message.reply_to_message.from_user.mention  
    if user_id in almutamard and reply_name in almutamard[user_id]:
        almutamard[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل العضو\n│ \n└ʙʏ : {reply_name}\n\n  نجس  😂♥️")
    else:
        await message.reply_text("مش مرفوع  نجس  اصلا")    

@Client.on_message(filters.command(["النجسين"], "") & filters.group, group=98)
async def almutamard_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in almutamard and almutamard[user_id]: 
        nq = "\n".join(almutamard[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  نجس  اصلا")
#..........................................    نجس        ................................................................
#..........................................    ديوث        ................................................................
aldayous = {}

@Client.on_message(filters.command(["رفع ديوث"], "") & filters.group, group=99)
async def rf3aldayous(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in aldayous:
        aldayous[user_id] = [] 
    aldayous[user_id].append(reply_name)   
    await message.reply_text(f"تم رفع ديوث\n│ \n└ʙʏ : {reply_name}\n\n رفعتو عشان يجيب اختو😂😂♥️")

@Client.on_message(filters.command(["تنزيل ديوث"], "") & filters.group, group=100)
async def tnzel_aldayous(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in aldayous and reply_name in aldayous[user_id]:
        aldayous[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل ديوث\n│ \n└ʙʏ : {reply_name}\n\n برا ي كسمك انتا واختك😂😂❤️")
    else:
        await message.reply_text("مش مرفوع  ديوث  اصلا")    

@Client.on_message(filters.command(["الديوثين"], "") & filters.group, group=101)
async def aldayous_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in aldayous and aldayous[user_id]: 
        nq = "\n".join(aldayous[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  ديوث  اصلا")
#..........................................    ديوث        ................................................................
#..........................................    شاذ        ................................................................
far1edaa = {}

@Client.on_message(filters.command(["رفع شاذ"], "") & filters.group, group=102)
async def rf3far1edaa(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لرفعه.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id not in far1edaa:
        far1edaa[user_id] = [] 
    far1edaa[user_id].append(reply_name)    
    await message.reply_text(f"تم رفع شاذ\n│ \n└ʙʏ : {reply_name}\n\nعشان طيزو كبيره😂😂♥️")

@Client.on_message(filters.command(["تنزيل شاذ"], "") & filters.group, group=103)
async def tnzel_far1edaa(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return
    if not message.reply_to_message:
        return await message.reply_text("يجب عليك الرد على رسالة الشخص لتنزيله.")
    if message.reply_to_message.from_user.username in caes:
       return await message.reply_text("• عذرآ لا تستطيع استخدام الأمر على مطور السورس")    
    reply_name = message.reply_to_message.from_user.mention    
    if user_id in far1edaa and reply_name in far1edaa[user_id]:
        far1edaa[user_id].remove(reply_name)
        await message.reply_text(f"تم تنزيل شاذ\n│ \n└ʙʏ : {reply_name}\n\nعلشان طلعت معفنه😂😂♥️")
    else:
        await message.reply_text("مش مرفوع  شاذ  اصلا")    

@Client.on_message(filters.command(["الشاذين"], "") & filters.group, group=104)
async def far1edaa_list(client, message):
    user_id = message.from_user.id
    if await johned(client, message):
     return
    if message.chat.id in src:
      return    
    if user_id in far1edaa and far1edaa[user_id]: 
        nq = "\n".join(far1edaa[user_id])
        await message.reply_text(nq)    
    else:
        await message.reply_text("انت مش رافع حد  شاذ  اصلا")

#..........................................    شاذ        ................................................................


